{
  "inkVersion": 21,
  "root": [
    [{ "->": "main" }, ["done", { "#f": 5, "#n": "g-0" }], null],
    "done",
    {
      "main": [
        [
          "^Ah, the day I had...",
          "\n",
          "^Look at me, barely a few years out of college and I am already working my ass off. At least I had a chance for a quick chat with Kelly today. Mmm... now that girl is truly hot. Empires would go to war over that amazing ass… Huh, enough of this. I need alcohole, badly. I think I am going to hit ‘Slick’ for a drink or two... Josh should be behind the bar tonight.",
          "\n",
          "^I take a quick shower and put on jeans and a shirt. The night is pleasantly warm and I decide to walk there. The bar isn’t far and I feel like clearing my head.",
          "\n",
          "^It doesn’t take long before I glimpse the glowing sign. ‘Slick’ is a cool place. I haven’t been going out lately due to all the damn work but I remember having some good times in this bar.",
          "\n",
          "^I push the door and immediately spot Josh in his usual place. The guy is a good bartender.",
          "\n",
          "^“Hey!” I wave to him, and as I approach the bar, I take a look around the place. At the edge of the bar, there are two women who I judge to be slightly older than me - a brunette and a blonde. They both look quite attractive as far as my appraising eye can tell. Both are wearing jeans and boots and give off a slight rock/punk vibe.",
          "\n",
          "^As I glance to the right, I notice a lady old enough to be my mother sitting at the table alone and sipping drink from a wineglass. She looks classy in her elegant dress and high heels and gives me the impression of mature beauty. In the back, two couples are shooting pool.",
          "\n",
          "^I reach the bar.",
          "\n",
          "ev",
          "str",
          "^I take a quick shot and then make a move",
          "/str",
          "/ev",
          { "*": ".^.c-0", "flg": 20 },
          "ev",
          "str",
          "^I crack a few jokes with Josh to get into proper mood",
          "/str",
          "/ev",
          { "*": ".^.c-1", "flg": 20 },
          "ev",
          "str",
          "^I order a beer and wait and see what happens",
          "/str",
          "/ev",
          { "*": ".^.c-2", "flg": 20 },
          {
            "c-0": [
              "\n",
              "ev",
              { "VAR?": "dom" },
              1,
              "+",
              "/ev",
              { "VAR=": "dom", "re": true },
              { "->": "attack" },
              { "#f": 5 }
            ],
            "c-1": [
              "\n",
              "^“So, how’s life treating you mate? That girl of yours, Jennifer, still around?”",
              "\n",
              "^“Yeah,” Josh replies with a smile.",
              "\n",
              "^“Fuck, she must be insane.”",
              "\n",
              "^He laughs. “Don’t I know. I am a lucky guy though.”",
              "\n",
              "^“Yeah, I agree. A girl like that is sooo out of your league… Fuck, she must be even out of mine!”",
              "\n",
              "^We laugh and he looks at me with a question on his face. Am I ready to go for it?",
              "\n",
              [
                "ev",
                "str",
                "^I go for the two women at the bar",
                "/str",
                "/ev",
                { "*": ".^.c-0", "flg": 20 },
                "ev",
                "str",
                "^I go for the lady",
                "/str",
                "/ev",
                { "*": ".^.c-1", "flg": 20 },
                "ev",
                "str",
                "^I wait some more and see what happens",
                "/str",
                "/ev",
                { "*": ".^.c-2", "flg": 20 },
                {
                  "c-0": [
                    "\n",
                    "^\"My friend, you are good company but I would like to upgrade, if these two lovely girls allow me, of course,\" I say as I slide towards them with a confident smile. I motion to Josh to bring us a round of drinks as they both settle their eyes on me.",
                    "\n",
                    "^“Sure, why not,” the blonde replies.",
                    "\n",
                    { "->": "twowom" },
                    { "#f": 5 }
                  ],
                  "c-1": [
                    "\n",
                    "^I am in the mood for something different tonight. Is a good-looking mature lady beyond my reach?",
                    "\n",
                    "^“Josh, gimme a bottle of whatever wine the lady over there is drinking, and gimme a wineglass.”",
                    "\n",
                    "^“You are so going to crash and burn.”",
                    "\n",
                    "^“We’ll see,” I say as I go over to the mature woman’s table.",
                    "\n",
                    "^“May I have the pleasure of joining you,” I say, offering a small bow. I am putting on my best gentleman moves here.",
                    "\n",
                    "^“Pretty girls all around and you choose to make a move on an old lady like me?” she says with a smirk.",
                    "\n",
                    "^“Ma’am, I can’t help it. I must always go for the most beautiful woman. It’s a compulsion.”",
                    "\n",
                    "^She laughs. “Cheesy… but effective. Have a seat but drop the ma’am thing,” she says, motioning towards a chair.",
                    "\n",
                    { "->": "lady" },
                    { "#f": 5 }
                  ],
                  "c-2": [
                    "\n",
                    "ev",
                    { "VAR?": "dom" },
                    1,
                    "-",
                    "/ev",
                    { "VAR=": "dom", "re": true },
                    { "->": "passive" },
                    { "#f": 5 }
                  ]
                }
              ],
              { "#f": 5 }
            ],
            "c-2": [
              "\n",
              "ev",
              { "VAR?": "dom" },
              1,
              "-",
              "/ev",
              { "VAR=": "dom", "re": true },
              "^I take a few swigs of my beer, playing with the bottle and trying to gather the courage to make a move. But it seems I am not fast enough.",
              "\n",
              { "->": "passive" },
              { "#f": 5 }
            ]
          }
        ],
        { "#f": 1 }
      ],
      "attack": [
        [
          "^“Gimme a shot of tequila, Josh!”",
          "\n",
          "^“Feeling confident, eh?” Josh replies with a laugh. He can tell by my posture that I am willing to play tonight.",
          "\n",
          "^“You bet,” I say, downing my shot theatrically. Time to decide.",
          "\n",
          "ev",
          "str",
          "^I try my luck with the two women at the bar",
          "/str",
          "/ev",
          { "*": ".^.c-0", "flg": 20 },
          "ev",
          "str",
          "^I give it a go with the lady",
          "/str",
          "/ev",
          { "*": ".^.c-1", "flg": 20 },
          {
            "c-0": [
              "\n",
              "^\"My friend, you are good company but I would like to upgrade, if these two lovely girls allow me, of course,\" I say as I slide towards them with a confident smile. I motion to Josh to bring us a round of drinks as they both settle their eyes on me.",
              "\n",
              "^“Sure, why not,” the blonde replies.",
              "\n",
              { "->": "twowom" },
              { "#f": 5 }
            ],
            "c-1": [
              "\n",
              "^I am in the mood for something different tonight. Is a good-looking mature lady beyond my reach?",
              "\n",
              "^“Josh, gimme a bottle of whatever wine the lady over there is drinking, and gimme a wineglass.”",
              "\n",
              "^“You are so going to crash and burn.”",
              "\n",
              "^“We’ll see,” I say as I go over to the mature woman’s table.",
              "\n",
              "^“May I have the pleasure of joining you,” I say, offering a small bow. I am putting on my best gentleman moves here.",
              "\n",
              "^“Pretty girls all around and you choose to make a move on an old lady like me?” she says with a smirk.",
              "\n",
              "^“Ma’am, I can’t help it. I must always go for the most beautiful woman. It’s a compulsion.”",
              "\n",
              "^She laughs. “Cheesy… but effective. Have a seat but drop the ma’am thing,” she says, motioning towards a chair.",
              "\n",
              { "->": "lady" },
              { "#f": 5 }
            ]
          }
        ],
        { "#f": 1 }
      ],
      "passive": [
        "ev",
        1,
        2,
        "rnd",
        "/ev",
        { "VAR=": "rng", "re": true },
        "\n",
        "ev",
        { "VAR?": "rng" },
        "/ev",
        [
          "du",
          "ev",
          1,
          "==",
          "/ev",
          { "->": ".^.b", "c": true },
          {
            "b": [
              "pop",
              "\n",
              "^\"Why don't you come over and join us,\" one of the two women - the blonde, says.",
              "\n",
              "^\"My pleasure,\" I reply as Josh mouths 'good luck'. I slide over to them.",
              "\n",
              { "->": "twowom" },
              { "->": ".^.^.^.13" },
              null
            ]
          }
        ],
        [
          "du",
          "ev",
          2,
          "==",
          "/ev",
          { "->": ".^.b", "c": true },
          {
            "b": [
              "pop",
              "\n",
              "^Josh walks away from me for a moment and then returns.",
              "\n",
              "^“I believe the lady over there would like you to join her,” Josh says, pointing with his head.",
              "\n",
              "^“Fuck…\" I say, turning to look where he is pointing. \"I am one lucky SOB.”",
              "\n",
              "^“Yes, you are. I fucking hate you,” Josh says, shaking his head.",
              "\n",
              "^I grin at him. “Gimme a bottle of the wine she is drinking and a wineglass.” Buying the drinks gives me back some of my pride. I walk over there and place the bottle on the table as she motions me to sit.",
              "\n",
              { "->": "lady" },
              { "->": ".^.^.^.13" },
              null
            ]
          }
        ],
        "pop",
        "nop",
        "\n",
        { "#f": 1 }
      ],
      "twowom": [
        [
          "^“I’m Donna,” the brunette says. She looks maybe a few years older than my 23 and has a fantastic smile. I smile back without thinking.",
          "\n",
          "^“Elizabeth,” the blonde says, taking a swig of her beer. She is definitely older, maybe early thirties. There is a teasing look on her face as she plays with her ponytail for a moment.",
          "\n",
          "^“Great to meet you, ladies. I’m Paul.”",
          "\n",
          "^“So, this clearly isn’t your first time here,” Donna says.",
          "\n",
          "^“Yeah, I used to be a regular but I haven’t had much time lately. Work sucks,” I say, trying to keep my gaze on her face. The way her top is swaying, I have a feeling she isn’t wearing a bra. I feel my cock’s immediate reaction to that thought.",
          "\n",
          "ev",
          "str",
          "^I ask about them and flirt",
          "/str",
          "/ev",
          { "*": ".^.c-0", "flg": 20 },
          "ev",
          "str",
          "^I let them steer the conversation",
          "/str",
          "/ev",
          { "*": ".^.c-1", "flg": 20 },
          "ev",
          "str",
          "^I crack a joke with Josh about old times",
          "/str",
          "/ev",
          { "*": ".^.c-2", "flg": 20 },
          {
            "c-0": [
              "\n",
              "ev",
              { "VAR?": "dom" },
              1,
              "+",
              "/ev",
              { "VAR=": "dom", "re": true },
              "^\"Anyway, tell me about yourselves. Two such beautiful girls and no guys? Or am I maybe barking up the wrong tree here,\" I say with my most charming smile.",
              "\n",
              "^“Oh? Were you maybe garnering some hopes?” Elizabeth asks, raising an eyebrow at me. She is still playing with her hair and there is a hint of mischief on her face, even if she clearly wants to intimidate me. Her eyes are light blue and I wonder if she could be a natural blonde...",
              "\n",
              "^“Hey, I am happy with just the pleasure of your company and conversation tonight… but a guy has to ask,” I say, directing some of my charm towards the blonde. A hint of a smile appears on her face.",
              "\n",
              "^“Good save,” the brunette, Donna says, taking a sip of her beer.",
              "\n",
              { "->": "twowom2" },
              { "#f": 5 }
            ],
            "c-1": [
              "\n",
              "ev",
              { "VAR?": "dom" },
              1,
              "-",
              "/ev",
              { "VAR=": "dom", "re": true },
              "^I take a swig at my beer, seemingly busy quenching my thirst. The women watch me appraisingly.",
              "\n",
              "^“You mentioned that you hate your work,” Elizabeth asks.",
              "\n",
              "^“I work in IT. It’s not that bad, I guess, but there are days… Well, as long as it provides me with enough money to buy drinks for pretty women, I’m happy.”",
              "\n",
              { "->": "twowom2" },
              { "#f": 5 }
            ],
            "c-2": [
              "\n",
              "^“Hey Josh, what’s my best record here?” I call out.",
              "\n",
              "^Josh smirks. “Mmm… fifteen beers, six broken glasses and I believe four rejections in a single night.”",
              "\n",
              "^“Lies!” I cry out as the girls laugh. “I would have succeeded with the fourth had I not collapsed!”",
              "\n",
              "^“He is just envious, you know,” I say conspiratorially.",
              "\n",
              "^“Sure I am.”",
              "\n",
              { "->": "twowom2" },
              { "#f": 5 }
            ]
          }
        ],
        { "#f": 1 }
      ],
      "twowom2": [
        [
          "^“I am beginning to realize why you are a regular in a bar with this name,” Donna says, chuckling. There is that lovely smile again.",
          "\n",
          "^\"So, what do you girls do for a living?\"",
          "\n",
          "^\"I work in a bank, and Donna works as a paralegal,\" Elizabeth says. She seems to be the leader of the duo.",
          "\n",
          "^“Cool.”",
          "\n",
          "^‘Sugar’ by Maroon 5 starts playing in the background and I begin tapping my hands on my thighs to the rhythm of the music. Donna looks at me in amusement.",
          "\n",
          "^“I love this song,” I say and smile, hoping to see her own smile again. And there it is.",
          "\n",
          "^“Maroon 5 is okay,” she says.",
          "\n",
          "^“Oh, I sense a ‘but’?”",
          "\n",
          "^“No ‘buts’,” Donna says with a chuckle. “They really are okay. We just like harder stuff, don’t we Liz?” Donna says, sharing a look with Elizabeth.",
          "\n",
          "ev",
          "str",
          "^I ask about music they like",
          "/str",
          "/ev",
          { "*": ".^.c-0", "flg": 20 },
          "ev",
          "str",
          "^I say I am the expert of hard",
          "/str",
          "/ev",
          { "*": ".^.c-1", "flg": 20 },
          "ev",
          "str",
          "^I can't help blushing",
          "/str",
          "/ev",
          { "*": ".^.c-2", "flg": 20 },
          {
            "c-0": [
              "\n",
              "^“So what is your favorite band then?”",
              "\n",
              "^“Linkin Park,” Donna says.",
              "\n",
              "^“Foo fighters,” Elizabeth chimes in.",
              "\n",
              "^“I like those bands too! Well, perhaps not all of their songs.”",
              "\n",
              "^“We understand, you like softer stuff,” Donna says with a smirk.",
              "\n",
              "^“Hey, I can’t help being a true romantic, you know,” I say with an apologetic smile. The girls chuckle.",
              "\n",
              { "->": "twowom3" },
              { "#f": 5 }
            ],
            "c-1": [
              "\n",
              "ev",
              { "VAR?": "dom" },
              1,
              "+",
              "/ev",
              { "VAR=": "dom", "re": true },
              "^“Oh, you do, do you? Well, you are in good company tonight,” I say with a knowing smirk.",
              "\n",
              "^The girls laugh. “Sounds like boasting to me,” Elizabeth says.",
              "\n",
              "^“Nope, just simple facts,” I say, giving her a confident look. I see a glint of arousal in those blue eyes as she takes the beer bottle and swirls her tongue around the opening before taking a swig. Fuck, I am going to get a hardon…",
              "\n",
              { "->": "twowom3" },
              { "#f": 5 }
            ],
            "c-2": [
              "\n",
              "ev",
              { "VAR?": "dom" },
              1,
              "-",
              "/ev",
              { "VAR=": "dom", "re": true },
              "^“Oh, I think you embarrassed him, Donna,” Elizabeth says as I try to laugh it away.",
              "\n",
              "^“Relax, Paul. We don’t bite,” Donna says.",
              "\n",
              "^“Much,” Elizabeth adds as they chuckle and look at me predatorily.",
              "\n",
              "^“In that case, I can only hope to be a tasty meal,” I say, deciding to go along.",
              "\n",
              { "->": "twowom3" },
              { "#f": 5 }
            ]
          }
        ],
        { "#f": 1 }
      ],
      "twowom3": [
        [
          "^We order another round of drinks as the night progresses and we chat and laugh, the alcohol slowly loosening our inhibitions.",
          "\n",
          "^\"So what exactly were you hoping for tonight, Paul?\" Elizabeth asks playfully.",
          "\n",
          "^\"Yeah, Paul. Did you hope to seduce me or Liz?\" Donna asks. She has become much bolder after a couple of drinks.",
          "\n",
          "ev",
          "str",
          "^I tell Donna I pick her",
          "/str",
          "/ev",
          { "*": ".^.c-0", "flg": 20 },
          "ev",
          "str",
          "^I know it's not up to me to do the picking",
          "/str",
          "/ev",
          { "*": ".^.c-1", "flg": 20 },
          "ev",
          "str",
          "^I make a joke to avoid answering",
          "/str",
          "/ev",
          { "*": ".^.c-2", "flg": 20 },
          {
            "c-0": [
              "\n",
              "ev",
              { "VAR?": "dom" },
              1,
              "+",
              "/ev",
              { "VAR=": "dom", "re": true },
              "^\"Well,\" I say in my best diplomatic voice. “You are both beautiful, but Donna is definitely my type,” I say, looking straight at her. She gives me that signature smile of hers and blushes slightly to my absolute delight.",
              "\n",
              "^“I hope that didn’t offend you, Liz,” I say, turning to see the blonde’s reaction. This is tricky ground as they are clearly close, and I need to make sure I do this right.",
              "\n",
              "^“No, I like your directness,” Elizabeth says.",
              "\n",
              "^“But there is just one problem with that…” she says, smiling mischievously.",
              "\n",
              "^“There is?”",
              "\n",
              { "->": "twowom4" },
              { "#f": 5 }
            ],
            "c-1": [
              "\n",
              "ev",
              { "VAR?": "dom" },
              1,
              "-",
              "/ev",
              { "VAR=": "dom", "re": true },
              "^“Oh, I just wanted to spend some time in great company,” I say, trying to sound relaxed. Elizabeth raises an eyebrow in question.",
              "\n",
              "^“…and if something comes out of it, I know it’s not really up to me to do the picking. I’m a realistic guy,” I say with what I hope is a disarming shrug.",
              "\n",
              "^“Oh, a guy who knows his place…” Elizabeth says biting her lip.",
              "\n",
              "^“It’s a part of his charm, Liz,” Donna says in support. “What if I decided to pick you for myself,” Donna asks, looking at me with a hint of lust in her words. I fucking love alcohol.",
              "\n",
              "^“Then I would be the luckiest guy in the world,” I say, smiling.",
              "\n",
              "^Elizabeth turns briefly to set her beer on the bar and then pierces me with a look.",
              "\n",
              { "->": "twowom4" },
              { "#f": 5 }
            ],
            "c-2": [
              "\n",
              "^“Ho-ho! I am so not answering that question, my dear ladies,” I say, laughing. “I’ll let my actions speak rather than my words.”",
              "\n",
              "^And what do I want? Donna is young and pretty and she seems to be easygoing and kind. On top of that, her breasts must be amazing… But then again, Elizabeth gives off the vibe of a true beast in bed. She looks like she is ready to devour me.",
              "\n",
              "^\"He looks torn. Maybe we should help him,\" Donna says.",
              "\n",
              "^Elizabeth looks sharply at her friend and something passes between them.",
              "\n",
              { "->": "twowom4" },
              { "#f": 5 }
            ]
          }
        ],
        { "#f": 1 }
      ],
      "twowom4": [
        [
          "^“Yeah,” she says, leaning in to whisper, her hand touching my thigh. “You see, Donna and I… we share… everything,” she whispers in my ear, her hot breath triggering goosebumps all over my body.",
          "\n",
          "^Oh fuck... are they serious? Can I be this lucky? Maybe they are just teasing me; maybe I can still fuck this up...",
          "\n",
          "ev",
          "str",
          "^I go for it",
          "/str",
          "/ev",
          { "*": ".^.c-0", "flg": 20 },
          "ev",
          "str",
          "^I laugh. I can't be sure if she's serious or not",
          "/str",
          "/ev",
          { "*": ".^.c-1", "flg": 20 },
          "ev",
          "str",
          "^I'm too stunned to react",
          "/str",
          "/ev",
          { "*": ".^.c-2", "flg": 20 },
          {
            "c-0": [
              "\n",
              "ev",
              { "VAR?": "dom" },
              1,
              "+",
              "/ev",
              { "VAR=": "dom", "re": true },
              "^I turn my head suddenly, my lips brushing against hers. I lean in and she hesitates only for a second. Our lips meet and I feel a jolt of pleasure.",
              "\n",
              "^\"Nice...\" Donna whispers as Elizabeth finally pulls back from me.",
              "\n",
              "^\"Yes... not bad at all,\" she says, licking her lips.",
              "\n",
              { "->": "twowom5" },
              { "#f": 5 }
            ],
            "c-1": [
              "\n",
              "^“Wow, I am in way over my head,” I laugh, trying to suppress the signs of my arousal… and failing. It’s still hard to tell if they are playing with me or not, but I swear I can feel they are aroused as well.",
              "\n",
              "^Fuck. I can’t just do nothing like a pussy. I have to make a mov-",
              "\n",
              { "->": "twowom5" },
              { "#f": 5 }
            ],
            "c-2": [
              "\n",
              "ev",
              { "VAR?": "dom" },
              1,
              "-",
              "/ev",
              { "VAR=": "dom", "re": true },
              "^Fuck fuck fuck. I know I should maybe do something, but I’m afraid I’ll blurt out something stupid. I am so fucking turned on… I reach for my beer and take a big swig, hoping for some liquid courage. Elizabeth’s grip on my thigh is becoming stronger by the second and the look Donna is giving me… It’s the look of a predator. This is serious... it has to be. I must-",
              "\n",
              { "->": "twowom5" },
              { "#f": 5 }
            ]
          }
        ],
        { "#f": 1 }
      ],
      "twowom5": [
        [
          "^“Let’s get out of here,” Donna says suddenly, voicing what was on everyone’s mind. Within a minute, we are outside, hailing a cab. As the taxi stops in front of us, I wonder where I am going to sit.",
          "\n",
          "ev",
          "str",
          "^I sit at the front. No need to crowd the girls",
          "/str",
          "/ev",
          { "*": ".^.c-0", "flg": 20 },
          "ev",
          "str",
          "^I let both of them take their spots and I sit next to them",
          "/str",
          "/ev",
          { "*": ".^.c-1", "flg": 20 },
          "ev",
          "str",
          "^I sit between them. It's the best fucking place",
          "/str",
          "/ev",
          { "*": ".^.c-2", "flg": 20 },
          {
            "c-0": [
              "\n",
              "ev",
              { "VAR?": "dom" },
              1,
              "-",
              "/ev",
              { "VAR=": "dom", "re": true },
              { "->": "twowomcab" },
              { "#f": 5 }
            ],
            "c-1": ["\n", { "->": "twowomcab" }, { "#f": 5 }],
            "c-2": [
              "\n",
              "ev",
              { "VAR?": "dom" },
              1,
              "+",
              "/ev",
              { "VAR=": "dom", "re": true },
              { "->": "twowomcab" },
              { "#f": 5 }
            ]
          }
        ],
        { "#f": 1 }
      ],
      "twowomcab": [
        "^We get into the cab and we soon reach the apartment they seem to be sharing. Flatmates with benefits?",
        "\n",
        "^The apartment seems spacious and furnished with taste. A large sectional sofa with extensions dominates the living room.",
        "\n",
        "^“Nice place,” I say, looking around.",
        "\n",
        "^“Yeah, we love it,” Elizabeth says as we take a seat on the sofa while Donna goes to bring beers for us. A moment later, Linkin Park starts playing on the sound system.",
        "\n",
        "ev",
        { "VAR?": "dom" },
        0,
        "<",
        "/ev",
        [
          { "->": ".^.b", "c": true },
          { "b": ["\n", { "->": "twowomsubsex" }, { "->": ".^.^.^.15" }, null] }
        ],
        [
          { "->": ".^.b" },
          { "b": ["\n", { "->": "twowomdomsex" }, { "->": ".^.^.^.15" }, null] }
        ],
        "nop",
        "\n",
        { "#f": 1 }
      ],
      "twowomsubsex": [
        "^“You don’t seem too anxious for someone who has just entered a lion’s den…” Liz says to me, taking the beer from Donna’s hands.",
        "\n",
        "^“Maybe I don’t have a problem with being prey…” I reply with a smirk of fake confidence.",
        "\n",
        "^“We love them like that, don’t we, Liz,” Donna says with a chuckle.",
        "\n",
        "^“We sure do…” Liz says, her face getting that predatory expression again. Fuck. I could tell I was in for an extraordinary night that would push my boundaries. But with two attractive women like them, I was more than willing to take that risk.",
        "\n",
        "^“So why don’t you give us a glimpse of our tonight’s prey,” Liz asks after a moment.",
        "\n",
        "^“A glimpse?” I ask anxiously.",
        "\n",
        "^“Take off your shirt.”",
        "\n",
        "^“Oh…” I say, taking a swig. They aren’t wasting any time it seems.",
        "\n",
        "^“Let’s help him with the decision,” Donna says, giving me an encouraging smile. “Why don’t we do it together?” she adds, looking at Liz. Liz smiles at her.",
        "\n",
        "^“All right babe,” Liz says, getting to her feet. “You too,” she says, motioning for me to get up.",
        "\n",
        "^“Whatever we take off, you take off,” she says in a tone that takes no objections.",
        "\n",
        "^“Works for me,” I say, smiling.",
        "\n",
        "^“Mmm… I love this,” Donna says as we all start dancing to the rhythm of the music.",
        "\n",
        "^They both start brushing their bodies against each other, giving me a show that makes my cock stir. I want some of that action but one look from Liz tells me I am not allowed to join their intimate dance. Then, Liz reaches out and starts unbuttoning Donna’s blouse and Donna leans in to kiss her. Fuck me, I am gonna cum in my pants just from watching this.",
        "\n",
        "^Their tongues clash as Donna’s blouse comes off, revealing a terrific pair of tits in a red bra. Donna does the same with Liz’s blouse, and then raises an eyebrow at me.",
        "\n",
        "^“Oh right!” I exclaim, waking up from my trance and taking my shirt off in haste.",
        "\n",
        "^“Not bad at all…” Liz comments.",
        "\n",
        "^Piece by piece, we get rid of our footwear and our jeans until all the remains are their panties and my boxers. I take a moment to appraise their bodies.",
        "\n",
        "^Fuck. Donna is the fleshier one, her curves soft and magnificent. Liz is athletic and toned, with a smaller chest but with an amazing, firm ass and strong, meaty thighs. They are both eye candies in their own way.",
        "\n",
        "^“He likes what he sees, I'd say,” Liz says with a chuckle, pointing at the tent in my tight boxers.",
        "\n",
        "^“Of course he does,” Donna says, reclining on the sofa.",
        "\n",
        "^“Paul, why don’t you show her how much you like her body,” Liz says, sitting next to her.",
        "\n",
        "^“Lose the boxers first,” Donna says, licking her lips.",
        "\n",
        "^I don’t need to be told twice. My cock springs free and I eagerly push my hips forward to give them a better view.",
        "\n",
        "^“Oh… that’s really nice…” Donna says quickly. Liz doesn’t say anything but I can see it on her face that she is just as impressed.",
        "\n",
        "^“Enough showing off. Time for action,” Liz says, pointing at Donna.",
        "\n",
        "^“With pleasure,” I say eagerly, sitting next to Donna and leaning in to kiss her. She responds eagerly and damn, she is a good kisser. I feel her moan as our tongues clash, my hands straying all over her body.",
        "\n",
        "^“There’s more to her body than her lips, you know,” Liz says, smirking at us. I can she is going to be the one to direct the action.",
        "\n",
        "^I move down Donna’s neck, kissing and sucking, and I feel the heat emanating from her. Fuck me but she has to be as aroused as I am. Well, her arousal isn’t as obvious at least. On the other hand, my soldier keeps pointing up, unwaveringly. God made us men so easy to read.",
        "\n",
        "^“Ohh…” Donna moans as I reach her fleshy breasts. I grip both of her magnificent tits and I plant my face between them, just enjoying this heaven on earth for a moment.",
        "\n",
        "^I hear Liz chuckle in amusement and I start kissing them all over, finally deciding to latch onto one of the nipples.",
        "\n",
        "^“Agghh!” Donna cries out in pleasure as my mouth blurs from one nipple to the other, sucking and biting the tasty nubs. I go back and forth, squeezing and kissing her breasts, licking her nipples…",
        "\n",
        "^“I’d say that’s enough of that…” I hear Liz say through the haze of my obsession. “Donna’s panties are completely bathed. Time to get on your knees and show us what you know,” she adds as I meet her eyes. Her gaze is confident but I also see arousal on her face.",
        "\n",
        "^“Nothing would give me more pleasure…” I say, sinking to my knees and gazing at Donna. I can see the anticipation and desire in her eyes as I take off her wet panties. As her pretty face stretches into  that amazing smile, I immediately know I’ll do anything to satisfy her.",
        "\n",
        "ev",
        { "VAR?": "dom" },
        -3,
        "<",
        "/ev",
        [
          { "->": ".^.b", "c": true },
          {
            "b": [
              "\n",
              { "->": "twowomsupersubsex" },
              { "->": ".^.^.^.75" },
              null
            ]
          }
        ],
        [
          { "->": ".^.b" },
          {
            "b": [
              "\n",
              { "->": "twowomjustsubsex" },
              { "->": ".^.^.^.75" },
              null
            ]
          }
        ],
        "nop",
        "\n",
        { "#f": 1 }
      ],
      "twowomsupersubsex": [
        [
          "^And I begin by kissing her inner thighs, slowly making my way towards her shaved pussy. I can already sense the raggedness of her breath. The anxiety and arousal are doing their work on her body. I can’t wait to taste her, yet I feel tempted to tease her instead, but before I can even make a move, her legs pull me in, locking behind my neck.",
          "\n",
          "^“I need you now…” I hear her whisper and I immediately comply, giving in to my hunger. She arches her hips and squeezes my head as I run my tongue all over her vulva, sampling her juices. And fuck me, she tastes divine.",
          "\n",
          "^“Ahh…” she moans, shifting her legs around my neck and running her soles all over my back. Even though I am the one providing pleasure, I feel such immense arousal at the touch of her silky thighs and soles on my body. I could stay on my knees doing this for hours and be completely satisfied. I shudder in pleasure at the thought and I barely fight off the need to touch my hard cock.",
          "\n",
          "^“Paul… why don’t you go on all fours… you don’t need hands anyway,” I hear Liz say in a raspy voice. I take a glimpse to the left and I see her touching Donna’s breast with one hand, while her other hand keeps straying toward her trimmed, blonde triangle. It seems she got rid of her panties in the meantime.",
          "\n",
          "^I comply without replying, strangely aroused by being ordered around this way. There is something about surrendering to Liz’s will that makes my body tingle all over. And it seems that she is getting off on it even more. Oh yeah, she is. As soon as I go back to licking Donna’s tasty pussy, I feel the touch of Liz’s feet on my side and my back.",
          "\n",
          "^“Mmmhh…” I moan into the juicy honeypot as the touch of two pairs of feet on my back sends shivers down my spine.",
          "\n",
          "^“God, I love how submissive he is…” I hear Liz say as she uses my back as her footstool.",
          "\n",
          "^I feel so fucking aroused… I can’t look between my legs for the moment because the pussy before me takes precedence, but I can swear my cock is leaking some precum… Oh fuck. Taken by my submissive trance, I swirl my tongue all over Donna’s pussy, trying to drink her dry. I play with her clit, relishing the approval that shows in the caress of her feet all over my back.",
          "\n",
          "^Then, I feel a sudden weight and a warm wet touch on my back. Fuck me, can it be?",
          "\n",
          "^“Oh yeah… ride this boy, Liz…” I hear Donna moan and even though her legs are keeping my head prisoner, I now know Liz is riding me like a horse, the maddening touch of her pussy on my lower back almost making me come on the spot.",
          "\n",
          "^“Come on, pony… satisfy my girl,” I hear Liz say and then I feel her feet on the back of my head, pushing me deeper into Donna’s pussy. Oh, the submissive ecstasy of it all as I gorge on Donna’s pussy, barely noticing Liz’s weight on my back. I can’t help admiring her sense of balance as she sits on my back and presses both her feet on my neck and the back of my head. But my focus is still the divine pussy before me. I suck in the clit and feel the effect immediately as Donna’s hips start arching. Her orgasm is approaching.",
          "\n",
          "^SLAP! SLAP!",
          "\n",
          "^“Faster pony, faster! She is almost there.” Liz exclaims, her blows landing on my naked butt.",
          "\n",
          "^“Fuck!” I cry out before redoubling my efforts on Donna’s pussy, lost in the submissive arousal. The exquisite taste of Donna’s pussy and her aroused moans, the touch of their legs and feet on my back and my head, the spanking with its mixture of pain and eroticism, and finally Liz’s weight and the touch of her wet pussy on my back… Holy fuck. One feather-light graze on my cock and I am certain I would blow my load all over the carpet.",
          "\n",
          "^“Ahhh! Yess! YEEESS!!” Donna cries out, her pussy gushing her orgasm on my tongue. Her body twitches and her legs squeeze my head as I nurse on her fluids, letting her ride out her orgasm fully. Her body convulses in a massive climax, her face stretched into a wonderful smile. I feel immense pleasure just by looking at her.",
          "\n",
          "^“Ohhh…” Donna moans, her grip finally loosening and her body relaxing as the last trickles of her orgasm fade away.",
          "\n",
          "^“Wow babe, that was really something…” I hear Liz say.",
          "\n",
          "^“You have to try his tongue, Liz… He is amazing,” Donna says, smiling at me and caressing my face gently.",
          "\n",
          "^“Oh, I intend to…” Liz leans in to whisper in my ear, still sitting on my back. The way she kept her balance on me the whole time one would think she is a cowgirl by profession…",
          "\n",
          "^“I’d say Paul is bursting with desire,” Donna says, chuckling. “His cock is leaking all over the place,”",
          "\n",
          "^“Fuck yes… I need to blow my load so bad,” I croak, finally detaching my mouth from Donna’s pussy.",
          "\n",
          "^“And you might get to do that… but you have to earn it,” I hear Liz say. Donna looks at her inquisitively and then laughs as Liz offers her a hand.",
          "\n",
          "^“We’ll continue this in the bedroom but first you need to take us there,” Liz says and I feel Donna’s weight settle on my upper back.",
          "\n",
          "^Holy shit. I can’t describe the mixture of strain and submissive arousal and desire I am feeling. Surprisingly, I don’t feel humiliated at being used as a horse by these two hotties. I can tell that’s not their play here. They seem to find this control, this domination, very arousing. Liz especially. And fuck me, if it’s doing for them as much as it’s doing for me, this is going to be one hell of a night.",
          "\n",
          "^“Damn right I will!” I growl as I slowly start making my way towards their bedroom. They keep steering me and patting my butt, their merry laughter filling the apartment. Then, Liz’s foot finds my aching cock and balls, the sudden desire making me speed up despite their overwhelming weight.",
          "\n",
          "^“Oh, you found his special spot,” Donna says laughing.",
          "\n",
          "^“Seems so,” Liz says, laughing as well. “Come on horsie, just a little bit more!”",
          "\n",
          "^Sweaty and tired but aroused out of my mind, I finally reach their bedroom, stopping next to their bed. I collapse to the floor, breathing hard, as they roll onto the large double bed. Fuck, I really thought I was in a better shape. Then again, I never did exercises like this one…",
          "\n",
          "^“Our pony is exhausted,” I hear Donna say sweetly.",
          "\n",
          "^“But he managed to carry us here… so maybe there is a chance for his reward,” Liz says playfully and I immediately perk up. Despite the strain, my cock has managed to stay hard. “Come on, horsie, get on the bed.”",
          "\n",
          "^I don’t need to be told twice. I climb onto the bed, rolling on my back and taking big breaths as they watch me with curiosity.",
          "\n",
          "^“Paul…” Liz says with unexpected warmth, her hand caressing my chest. “I love your submissiveness and desire to please… You are turning us both on so much,” she says as Donna joins the caressing. Fuck me, this is all so hot. Two naked beauties running their hands all over my body…",
          "\n",
          "^“Yeah, you have pleased me already…” Donna whispers in my ear, her lips making a trail all over my neck and chest. My whole body tingles in anticipation.",
          "\n",
          "^“…so we want to test you some more… by tying you up,” Liz says, her hand finding my rock-hard cock.",
          "\n",
          "^“Tie me to the bed?” I say in surprise as I sigh from the sudden pleasure.",
          "\n",
          "^“Yes…” Liz says, smiling. She leans in, the touch of her hot breath on my neck stirring my arousal further.",
          "\n",
          "^“Huh…”",
          "\n",
          "^“Wouldn’t you love to be at our mercy?” Liz whispers in my ear. She bites my neck gently and I shudder. Fuck me, this is one insanely hot predator. I turn my head to see Donna offer her most disarming smile.",
          "\n",
          "^What should I do?",
          "\n",
          "ev",
          "str",
          "^I let them tie me up",
          "/str",
          "/ev",
          { "*": ".^.c-0", "flg": 20 },
          "ev",
          "str",
          "^I prefer having my hands free",
          "/str",
          "/ev",
          { "*": ".^.c-1", "flg": 20 },
          {
            "c-0": [
              "\n",
              "ev",
              { "VAR?": "dom" },
              1,
              "-",
              "/ev",
              { "VAR=": "dom", "re": true },
              { "->": "twowomsupersubsextie" },
              { "#f": 5 }
            ],
            "c-1": ["\n", { "->": "twowomsupersubsexnotie" }, { "#f": 5 }]
          }
        ],
        { "#f": 1 }
      ],
      "twowomsupersubsextie": [
        [
          "^“Okay…” I say, releasing a breath I didn’t know I was holding.",
          "\n",
          "^“Excellent,” Liz says, kissing me with hunger. Our lips and tongues clash for a while and I am left breathless when she finally moves away.",
          "\n",
          "^In a matter of minutes, I find myself tied to the bed. I look at the silk restraints they used and chuckle even if I feel so much anxiety. They have done this before. Maybe they use them to tie each other?",
          "\n",
          "^My mind goes off rails, and I imagine men being tied and then disappearing after being thoroughly used for their pleasure. Fuck me, but I find myself aroused like never before as a sliver of fear enters my oversexed mind.",
          "\n",
          "^“Oh fuck…” I blurt out when Liz produces a flogger.",
          "\n",
          "^“Don’t worry…” she says, smiling, as the flogger moves up and down my chest. “If you please me, I won’t use it… much.”",
          "\n",
          "^And with that, I get my first taste of the flogger.",
          "\n",
          "^“Mmm…” I moan, pain and pleasure warring inside me. Liz watches me with feral hunger written all over her face.",
          "\n",
          "^“I need to feel that magic tongue now…” she says in a raspy voice, quickly mounting my head.",
          "\n",
          "^I lose my mind as that gorgeous blonde pussy descends towards my mouth and I attack it with all the pent-up arousal I am feeling.",
          "\n",
          "^“Holy Mother of god!” Liz cries out in pleasure as I stab my tongue deep inside her pussy, swirling, drinking, sucking… I feel her toned body shudder as I keep devouring her pussy, fueled further by Donna’s gentle teasing of my cock and balls.",
          "\n",
          "^Liz starts grinding her pussy on my mouth, her breath quickening, her eyes closed in ecstasy. There is no way she can last long at this tempo. I focus on her clit, licking and sucking like a madman as she rubs herself on my mouth, pressing hard.",
          "\n",
          "^“Fuck fuck fuuuuck!!” Liz cries out, her orgasm exploding on my lips. I drink her juices and twirl my tongue as she twitches in a powerful if somewhat short orgasm.",
          "\n",
          "^“Oh damn… I really needed that,” she says, panting and smiling down at me. “You were right babe, that’s one fantastic tongue.”",
          "\n",
          "^“I know. I would love to have another go at it,” I hear Donna say.",
          "\n",
          "^“The night is long, babe. Now go bring us all a beer. I need a few minutes to recover before I go for round two.”",
          "\n",
          "^The respite is very short, enough only for them to take a few swigs of the beer and to pour some in my mouth too.",
          "\n",
          "^“Okay,” Liz says, mounting my mouth in reverse this time and taking her flogger again. Fuck.",
          "\n",
          "^“You’ll get your turn later, babe,” Liz says chuckling at Donna’s disappointed face. I think it’s time for you to ride him and ride him good,” Liz adds and Donna perks up immediately.",
          "\n",
          "^Holy fuck. My cock sheathes inside Donna’s tight pussy and I find myself on cloud nine. The feeling, the warmth… My tongue plays with Liz’s pussy, relishing the flowing juices once again. It doesn’t get any better than this.",
          "\n",
          "^“Slower this time… I want to enjoy your tongue properly,” Liz says, and they both begin their ride with my tied naked body being the saddle.",
          "\n",
          "^Moans and sighs fill the room as they both get into a moderate rhythm. But being the only one who hasn’t come yet, it doesn’t take long before I get close. My body starts tensing and my grunts become more urgent together with the intensity of my pussy-licking.",
          "\n",
          "^“Don’t you dare come before she does!” Liz says, noticing my body language. “Here, let me help you with that,” she says with a chuckle and I gasp in pain as the flogger lands on my chest.",
          "\n",
          "^Oh fuck. She starts flogging my chest with varying intensity, occasionally reaching out to twist my nipples. Waves of pain and masochistic pleasure rack my body, but it seems that her tactics worked. The sudden pain takes me away from the edge of my orgasm several times, despite the incredible ride that Donna is having on my aching cock.",
          "\n",
          "^It’s hard to explain the blend of feelings and sensations in my body as two beautiful women ride me in such a way. My cock and mouth are in heaven, whilst my chest keeps sending mixed signals. Yet both women are clearly enjoying this immensely and that’s all that matters in the end.",
          "\n",
          "^“Ahh! I’m getting close…” Donna says with urgency in her voice and I feel her picking up the tempo, her pussy slamming down on my balls. Holy fuck but it feels so good.",
          "\n",
          "^“Ride that cock baby, ride it!” Liz urges her, mashing her pussy on my lips. She is also getting there.",
          "\n",
          "^“Ahh… kiss me, kiss meee!” Donna cries out and I feel them lean towards each other. Damn, I would love to watch this scene from a different perspective… but no what am I saying here. I have the best fucking seat in this show… Or well, I am the best fucking seat in the show.",
          "\n",
          "^“Come, baby, come!” Liz exclaims, flogging my chest and prompting Donna’s wild climax.",
          "\n",
          "^“AHH!... Yes!....... FUCK!... YEESS!” Donna screams, her body convulsing in climax, her pussy milking my cock mercilessly. And for once I feel thankful for the flogging, otherwise, there is no way I would have been able to stop myself from spurting my hot cum inside her womb.",
          "\n",
          "^“That’s it baby! Use that cock!” Lizz exclaims in joy as Donna rides out her orgasm fully.",
          "\n",
          "^“Oh baby… this has been an amazing ride,” I hear Donna say as she unsheathes my cock.",
          "\n",
          "^“Wow, look at that straining cock…” Liz says in amusement, her pussy grinding down on my mouth. She is leaking a lot and clearly, she isn’t far away from her own orgasm. “What do we do with it…”",
          "\n",
          "^She gyrates her hips all over my face and then stops as if to wait for my answer.",
          "\n",
          "^“I need to cum so bad…” I croak.",
          "\n",
          "^“That’s easy to believe,” she says, laughing. “You’ve been amazing and I think you earned the right to cum. But… you’ll need to beg for it.”",
          "\n",
          "^“Oh fuck…” I say as I feel my cock finding a home between Donna’s busty tits. She starts rubbing my cock between them and I am so fucking close.",
          "\n",
          "^“So, are you going to beg for it?! Come on,” Liz says, mashing her pussy on my lips.",
          "\n",
          "ev",
          "str",
          "^I beg to cum",
          "/str",
          "/ev",
          { "*": ".^.c-0", "flg": 20 },
          "ev",
          "str",
          "^I ain't begging. It's all in their hands",
          "/str",
          "/ev",
          { "*": ".^.c-1", "flg": 20 },
          {
            "c-0": [
              "\n",
              "^“I beg you to let me cum!” I cry out, my arousal and need for release too great to even consider anything else.",
              "\n",
              "^“That’s a good boy…” Liz purrs, the rhythm of her grinding becoming more urgent. “Ahhh.. make sure we come together, babe…”",
              "\n",
              "^“I will,” I hear Donna say as she titfucks my cock. She keeps taking me to the edge and back as Liz’s moans turn into little screams of pleasure. She is riding my mouth hard, her toned thighs tense and coated in sweat.",
              "\n",
              "^“I’m so close… now… now…. NOOOW!!” Liz screams and  fuck me, I scream too as our orgasms explode together, thanks to Donna’s magnificent timing. I spurt and I spurt and I spurt so fucking much as I drown in Liz’s fluids, the sweet flesh of her pussy muffling the roar of my pleasure.",
              "\n",
              "^And holy fuck this woman comes copiously. Her body is a marvel of toned yet feminine muscles, the tension of her orgasm displaying them so beautifully. But I doubt my body looks much different as my orgasm thunders throughout my muscles, my upper body straining and lifting Liz's weight.",
              "\n",
              "^“Ohh… babe, what a ride…” Liz croaks, finally dismounting my head and letting me see Donna’s joyous face. Her busty chest and her neck are all painted white. Fuck, I can’t remember the last time I produced so much cum…",
              "\n",
              "^“Paul, this has been wonderful,” Liz says kissing my lips and tasting her own juices. “So tell me, do you feel this night is over, or would you like to stay tied?” she asks playfully.",
              "\n",
              { "->": "twowomsupersubsexend" },
              { "#f": 5 }
            ],
            "c-1": [
              "\n",
              "^“I am not going to beg!” I roar. “My orgasm is all in your hands… whatever you decide,” I say with a strange mix of submissiveness and alpha impulses.",
              "\n",
              "^“Oh fuck!” Lizz exclaims, looking at me in awe. The immense kick she is getting out of my 'assertive surrender' is written all over her face. I glimpse a joyous smile before she resumes her ride of my mouth.",
              "\n",
              "^“Tease him babe… edge him until he goes crazy!” she croaks.",
              "\n",
              "^“I will,” I hear Donna say as she starts titfucking my cock. She keeps taking me to the edge and back as Liz’s moans turn into little screams of pleasure. She is riding my mouth hard, her toned thighs tense and coated in sweat. And for the life of me, I can’t say if I am in heaven or hell…",
              "\n",
              "^“I’m so close… so close… Don’t let him CUUUM!!” Liz screams and explodes in orgasm as Donna takes me to the edge and denies me once again.",
              "\n",
              "^Holy fuck, the torture and bliss of it all as I drown in Liz’s fluids, the sweet flesh of her pussy muffling the roar of my frustration.",
              "\n",
              "^And damn, this woman comes copiously. Her body is a marvel of toned yet feminine muscles, the tension of her orgasm displaying them so beautifully. But I doubt my body looks much different as this last gigantic denial makes me strain and arch my hips with need, the silk restraints digging into my wrists.",
              "\n",
              "^“Ohh… babe, what a ride…” Liz croaks, finally dismounting my head and looking at me, her eyes switching between my face and my swollen aching cock…",
              "\n",
              "^“Paul… I believe I am falling in love with you,” she purrs, kissing my lips vigorously and tasting her own juices.",
              "\n",
              "^“You have been more than wonderful but I feel we can take you even further,” she says, nibbling on my lips and caressing my chest. The somewhat bitchy attitude she has displayed previously is all gone, and I see so much affection and passion on her face.",
              "\n",
              "^“So tell me, do you feel this night is over, or would you like to stay tied?! I make no promises about you cumming…” she says with a hint of playful lust in her eyes.",
              "\n",
              { "->": "twowomsupersubsexend" },
              { "#f": 5 }
            ]
          }
        ],
        { "#f": 1 }
      ],
      "twowomsupersubsexend": [
        "^Well fuck, I think you already know the answer to that question, eh?!",
        "\n",
        "^THE END.",
        "\n",
        "done",
        { "#f": 1 }
      ],
      "twowomsupersubsexnotie": [
        [
          "^“That would be one hot experience… but I’d rather keep my hands free,” I say to their disappointment and I rush to add “I want to be able to touch and caress your bodies. You are both so fucking hot.”",
          "\n",
          "^“Good save,” Liz snorts. “Okay, I can definitely see the appeal of feeling your hands on me,” she says kissing me.",
          "\n",
          "^I start caressing her thighs, massaging the toned muscles as if to prove my point.",
          "\n",
          "^“Mmm… okay,” she purrs, “… but right now, I am more interested in your tongue.”",
          "\n",
          "^I smile and start moving between her legs but she stops me and pushes me on the bed. “Not like that. I want to ride your face,” she says, giving me a smoldering look, and then straddles my face. I kiss her meaty thighs as she takes her place on top of me, sensing the heat emanating from her pussy. Fuck, this is going to be a real treat.",
          "\n",
          "^“Ahhh… nice…” she purrs as I taste her and yeah, I was right. Without much delay, I plunge my tongue deep into her vulva, her body arching in response. I lick her pussy relentlessly and she leaks rivers into my mouth. It doesn’t seem like this one is going to take long.",
          "\n",
          "^“Ohh… fuck, yes!” Liz moans and I moan too, feeling Donna’s touch on my cock. She teases me for a while, her fingers making a trace from the root of my balls to the tip of my cock and back… As if I needed more incentive.",
          "\n",
          "^But before long, Liz’s moans become more urgent, her hips gyrating on my working mouth. And suddenly I feel Donna’s warm, soft body on top of mine. Oh fuck. I feel her hot breath on my neck as she pushes Liz to lean forward. Her tongue joins mine for a moment before switching to lick Liz’s rosebud.",
          "\n",
          "^“Fuuuck!” Liz screams as our warm tongues lick her holes with vigor. We barely manage to hold on to her as she starts mashing her pussy against my face with urgency.",
          "\n",
          "^“Ahhh… this is too fucking good… Ahhh! Yeeess! AHH!!” Liz screams, gushing into my mouth, her body shaking violently.",
          "\n",
          "^Her orgasm is powerful, fueled by our diligent tongues, but it doesn’t last long. She soon rolls over on the bed, breathing hard.",
          "\n",
          "^“Oh my god, that was really something…” she says, laughing. “We have to do that again.”",
          "\n",
          "^“First, I want him to fuck me,” Donna says, leaning down to kiss me, her tongue scooping Liz’s juices off of my face.",
          "\n",
          "^“Fuck yes!” I blurt out. My cock has been ready to see some action for quite some time.",
          "\n",
          "^“This will be fun,” Liz says as Donna goes on all fours and looks at me expectantly.",
          "\n",
          "^Doggystyle. I am sure as hell gonna love this.",
          "\n",
          "^I go behind her, placing a few kisses on her buttocks, and then bend down to kiss and lick her upturned soles. I can’t help myself, her feet are just too damn sexy. She giggles in approval as I move up, swiping my tongue at her pussy to check the readiness status. Unnecessarily, it turns out. Finally, I slide my hard cock inside her warm pussy and growl like a hungry dog.",
          "\n",
          "^“Ohh…” Donna moans, turning her head to give me a lusty smile. Fuck me, her pussy feels so damn good…",
          "\n",
          "^I start fucking her slowly, I don’t want to rush. I want to enjoy this properly. Our bodies settle into a rhythm, our soft moans filling the room, while Liz watches us with curiosity. I can see by the way she is looking at us that the violent orgasm she just had didn’t take much from her arousal. After a few minutes of watching our slow fucking, she becomes impatient.",
          "\n",
          "^“You guys are too slow… I think I should motivate you,” she says, going behind me and reaching out with one hand to caress my buttocks, the other hand touching the top of Donna’s ass. I moan, feeling her breasts touching my back briefly…",
          "\n",
          "^SLAP!  SLAP! SLAP!",
          "\n",
          "^Her palms land on our buttocks and fuck me, it’s working… I feel shivers of pleasure going through Donna’s body, and I am hardly any better. Who would have thought that being spanked would arouse me so…",
          "\n",
          "^SLAP!  SLAP!  SLAP!",
          "\n",
          "^I pick up the tempo, and Donna’s ass is meeting me halfway. We all grunt and moan in pleasure, our moans topped only by the sound of our asses being spanked.",
          "\n",
          "^“Damn… you are both making me so hot…” Liz says, sounding out of breath. She slides on the bed, settling to lie in front of Donna. With a look of pure lust, she pulls Donna's head down towards her pussy.",
          "\n",
          "^“Come on babe… I need your tongue,” she purrs and Donna happily obliges.",
          "\n",
          "^Shit, what an amazing sight… Looking at Donna’s ass and back and at Liz’s amazing, toned body shuddering in pleasure. I start ramming my cock harder, pushing Donna’s face into Liz’s pussy. I can see by the way Liz is reacting that Donna’s tongue is working hard… and the way her pussy is clenching around my cock I can tell she is getting close.",
          "\n",
          "^“Oh fuuuck! Mmghhg!” Donna cries out, quickly muffled by Liz’s pussy. Her butt starts slamming back into me, her orgasm clearly about to explode.",
          "\n",
          "^“MMGHGG!!! FUUCK! YEAH!” she screams, her body twitching, her pussy convulsing around my cock. No pussy was going to muffle that orgasm, it seems… She switches to growling, taking a few hungry licks at Liz’s pussy in between waves of aftershock.",
          "\n",
          "^\"Paul! Yess! Pauuul!\"",
          "\n",
          "^Fuck yeah, it's good to hear my name screamed like that.",
          "\n",
          "^“Good work satisfying my baby here,” Liz calls out, smiling at me and pressing Donna’s face into her pussy. “Now let's see if we can get there together,” she says, rubbing her pussy on Donna’s face. “Come on baby, work that tongue… make me cum!”",
          "\n",
          "^“Fuck, I won’t last long…” I moan, slamming my cock inside Donna’s pussy. My rhythm is frenetic now. I need to blow my load.",
          "\n",
          "^“You hear that babe?! Come on… come on … eat that pussy…” Liz purrs, her body showing the first signs of impending climax. And not a minute too soon, because my balls are churning, my working cock primed and ready to shoot… It’s just a question of where?",
          "\n",
          "ev",
          "str",
          "^I cum on Donna's butt",
          "/str",
          "/ev",
          { "*": ".^.c-0", "flg": 20 },
          "ev",
          "str",
          "^I cum on Donna's feet",
          "/str",
          "/ev",
          { "*": ".^.c-1", "flg": 20 },
          {
            "c-0": [
              "\n",
              "^“Ahh… That’s it baby, suck my clit… Yeah, suck iiit! AHH!!” Liz cries out as I pull my cock out, finishing myself between Donna’s buttocks.",
              "\n",
              "^“Fuuuck! Angghh!!” I growl and grunt as my body trashes in pleasure, my cum spraying all over Donna’s buttocks and back. And fuck me, it’s a geyser.",
              "\n",
              "^“Ohhh yeah! Look at that cock painting you… aahh!” Liz moans, her orgasm extending for much longer this time. Well, mine is hardly shorter… Waves of pleasure rack my body for quite a while, my cock spurting endlessly. As I finally start coming down from my high, I watch Donna’s painted back and laugh like a fool.",
              "\n",
              { "->": "twowomjustsubsexend" },
              { "#f": 5 }
            ],
            "c-1": [
              "\n",
              "^“Ahh… That’s it baby, suck my clit… Yeah, suck iiit! AHH!!” Liz cries out as I pull my cock out. I slide down quickly, grabbing Donna’s feet and rubbing my cock between them. Oh fuck, the feeling of those silky soles is heavenly.",
              "\n",
              "^“Fuuuck! Angghh!!” I growl and grunt as my body trashes in pleasure, my cum spraying all over Donna’s feet. And fuck me, it’s a geyser.",
              "\n",
              "^“Ohhh yeah! Look at that cock painting your feet babe… aahh!” Liz moans, her orgasm extending for much longer this time. Well, mine is hardly shorter… Waves of pleasure rack my body for quite a while, my cock spurting endlessly. As I finally start coming down from my high, I watch Donna’s cum covered feet and laugh like a fool.",
              "\n",
              { "->": "twowomjustsubsexend" },
              { "#f": 5 }
            ]
          }
        ],
        { "#f": 1 }
      ],
      "twowomjustsubsexend": [
        "^“Mmm… fuck,” Liz purrs when her body settles down. She runs her hand through Donna’s hair lovingly, her eyes switching between Donna and myself. Her bitchy attitude is mostly gone and all I see is affection and pleasure.",
        "\n",
        "^“It seems you passed the test with flying colors, Paul…”",
        "\n",
        "^“Damn right he did,” Donna adds chuckling.",
        "\n",
        "^“You are both amazing…” I breathe, the smile still glued to my face.",
        "\n",
        "^“Let’s get some drinks… and then it’s time for round two,” Liz says, smirking.",
        "\n",
        "^“Yeah… We don’t usually stop before round five, Paul,” Donna says mischievously, wiggling her butt at me.",
        "\n",
        "^Holy shit, what a night this is going to be…",
        "\n",
        "^THE END.",
        "\n",
        "done",
        { "#f": 1 }
      ],
      "twowomjustsubsex": [
        [
          "^And I begin by kissing her inner thighs, slowly making my way towards her shaved pussy. I can already sense the raggedness of her breath. The anxiety and arousal are doing their work on her body. I can’t wait to taste her, yet I feel tempted to tease her instead, but before I can even make a move, her legs pull me in, locking behind my neck.",
          "\n",
          "^“I need you now…” I hear her whisper and I immediately comply, giving in to my hunger. She arches her hips and squeezes my head as I run my tongue all over her vulva, sampling her juices. And fuck me, she tastes divine.",
          "\n",
          "^“Ahh…” she moans, shifting her legs around my neck and running her soles all over my back. Even though I am the one providing pleasure, I feel such immense arousal at the touch of her silky thighs and soles on my body. I could stay on my knees doing this for hours and be completely satisfied. I shudder in pleasure at the thought and I barely fight off the need to touch my hard cock.",
          "\n",
          "^I look up and I see Liz touching Donna’s breast with one hand, while her other hand keeps straying toward her trimmed, blonde triangle. It seems she got rid of her panties in the meantime.",
          "\n",
          "^As soon as I go back to licking Donna’s tasty pussy, I feel the touch of Liz’s feet on my side and my back.",
          "\n",
          "^“Mmmhh…” I moan into the juicy honeypot as the touch of two pairs of feet on my back sends shivers down my spine.",
          "\n",
          "^“God, I love his desire to please…” I hear Liz say as she caresses my back.",
          "\n",
          "^I feel so fucking aroused… I can’t look between my legs for the moment because the pussy before me takes precedence, but I can swear my cock is leaking some precum… Oh fuck. Taken by my submissive trance, I swirl my tongue all over Donna’s pussy, trying to drink her dry. I play with her clit, relishing the approval that shows in the caress of her feet all over my back.",
          "\n",
          "^“Oh yeah… suck them, Liz…” I hear Donna moan and I look up to see Liz sucking on her luscious breasts. Oh fuck, as if I needed more reasons to be aroused. I keep my focus on the divine pussy before me, while they kiss and play with each other. I suck in the clit and feel the effect immediately as Donna’s hips start arching. Her orgasm is approaching.",
          "\n",
          "^“Faster Paul, she is almost there,” Liz exclaims, giving me a playful slap on my buttocks.",
          "\n",
          "^“Fuck!” I cry out before redoubling my efforts on Donna’s pussy, lost in the submissive arousal. The exquisite taste of Donna’s pussy and her aroused moans, the touch of their legs and feet on my back, the sight of them kissing and caressing each other…. Holy fuck. One feather-light graze on my cock and I am certain I would blow my load all over the carpet.",
          "\n",
          "^“Ahhh! Yess! YEEESS!!” Donna cries out, her pussy gushing her orgasm on my tongue. Her body twitches and her legs squeeze my head as I nurse on her fluids, letting her ride out her orgasm fully. Her body convulses in a massive climax, her face stretched into a wonderful smile. I feel immense pleasure just by looking at her.",
          "\n",
          "^“Ohhh…” Donna moans, her grip finally loosening and her body relaxing as the last trickles of her orgasm fade away.",
          "\n",
          "^“Wow babe, that was really something…” I hear Liz say.",
          "\n",
          "^“You have to try his tongue, Liz… He is amazing,” Donna says, smiling at me and caressing my face gently.",
          "\n",
          "^“Oh, I intend to…” Liz chuckles.",
          "\n",
          "^“I’d say Paul is bursting with desire,” Donna says. “His cock is leaking all over the place,”",
          "\n",
          "^“Fuck yes… I need to blow my load so bad,” I croak, finally detaching my mouth from Donna’s pussy and getting to my feet.",
          "\n",
          "^“And you might get to do that… but we need to take this to the bedroom,” Liz says. “And I want you to take me there,” she says jumping on me for a piggyback ride. Donna laughs and grabs my hard cock, using it as a leash to pull me towards the bedroom. I find myself relishing this game they are playing, and fuck me, if it’s doing for them as much as it’s doing for me, this is going to be one hell of a night.",
          "\n",
          "^“Damn right I will!” I growl as Donna leads me to the bedroom. Liz’s foot finds my aching cock and balls, the sudden desire making me speed up despite her weight.",
          "\n",
          "^“Oh, you found his special spot,” Donna says laughing.",
          "\n",
          "^“Seems so,” Liz says, laughing as well. “Come on horsie, just a little bit more!”",
          "\n",
          "^We soon reach their bedroom, and before we know it, we find ourselves lying on the bed, me in between the two hotties.",
          "\n",
          "^“Paul…” Liz says with unexpected warmth, her hand caressing my chest. “I love your submissiveness and desire to please… You are turning us both on so much,” she says as Donna joins the caressing. Fuck me, this is all so hot. Two naked beauties running their hands all over my body…",
          "\n",
          "^“Yeah, you have pleased me already…” Donna whispers in my ear, her lips making a trail all over my neck and chest. My whole body tingles in anticipation.",
          "\n",
          "^“…so we want to test you some more… by tying you up,” Liz says, her hand finding my rock-hard cock.",
          "\n",
          "^“Tie me to the bed?” I say in surprise as I sigh from the sudden pleasure.",
          "\n",
          "^“Yes…” Liz says, smiling. She leans in, the touch of her hot breath on my neck stirring my arousal further.",
          "\n",
          "^“Huh…”",
          "\n",
          "^“Wouldn’t you love to be at our mercy?” Liz whispers in my ear. She bites my neck gently and I shudder. Fuck me, this is one insanely hot predator. I turn my head to see Donna offering her most disarming smile.",
          "\n",
          "^What should I do?",
          "\n",
          "ev",
          "str",
          "^I let them tie me up",
          "/str",
          "/ev",
          { "*": ".^.c-0", "flg": 20 },
          "ev",
          "str",
          "^I prefer having my hands free",
          "/str",
          "/ev",
          { "*": ".^.c-1", "flg": 20 },
          {
            "c-0": [
              "\n",
              "ev",
              { "VAR?": "dom" },
              1,
              "-",
              "/ev",
              { "VAR=": "dom", "re": true },
              { "->": "twowomsupersubsextie" },
              { "#f": 5 }
            ],
            "c-1": ["\n", { "->": "twowomsupersubsexnotie" }, { "#f": 5 }]
          }
        ],
        { "#f": 1 }
      ],
      "twowomdomsex": [
        "^“This beer is great,” I say, taking a big swig. “But you know what would be even better? Drinking it while watching two sexy women play with each other…” I say with a confident smirk.",
        "\n",
        "^Liz watches me intently for a while and then smiles quizzically. “Why not…” she says, pulling Donna to herself.",
        "\n",
        "^“Fuck...” I whisper as they start kissing passionately. They’ve clearly had sex before and the alcohol has further loosened the inhibitions…",
        "\n",
        "^“Mmm… baby I love your lips…” Donna moans as Liz kisses her hungrily, keeping her eyes on my face. Me watching them is clearly turning them on. The blonde’s hands start caressing Donna’s sizable breasts, and she quickly removes Donna’s blouse and bra, her mouth latching onto Donna’s nipple.",
        "\n",
        "^“Oh shit baby…”",
        "\n",
        "^“I am so hungry for you…” Liz purrs. “Take off my blouse… and jeans.”",
        "\n",
        "^Damn, this show is getting really hot. I take another quick swig of my beer, readjusting my pants slightly. My soldier is clearly approving of these two hotties.",
        "\n",
        "^They keep kissing and feasting on each other’s breasts, their moans becoming louder by the minute. I feel aroused as fuck and I am tempted to join them… but I decide not to. There is plenty of time for that and I want to get an eyeful first.",
        "\n",
        "^“Ohh… baby you are making me so hot…” Liz breathes. “Why don’t you show Paul how talented your tongue is…”",
        "\n",
        "^“Oh, yes…” Donna whispers, unbuttoning Liz’s jeans and taking them off. Liz sits back and relaxes on the sofa as Donna pulls off her panties. Fuck me, that toned body is such a sight… and the trimmed blonde pussy looks gorgeous. Donna seems to agree with me because she dives between Liz’s legs as soon as the blonde spreads her legs.",
        "\n",
        "^“Fuck yes… that’s it, baby, lick that pussy…” she moans in arousal, her eyes switching between Donna and myself. She is totally getting off on me watching her pussy being licked. And fuck me, my pants have become very uncomfortable. I slowly get rid of my clothes while Liz watches me with interest. I take another swig of my beer, my hand slowly working the shaft of my sizeable cock.",
        "\n",
        "ev",
        { "VAR?": "dom" },
        3,
        ">",
        "/ev",
        [
          { "->": ".^.b", "c": true },
          {
            "b": [
              "\n",
              { "->": "twowomsuperdomsex" },
              { "->": ".^.^.^.29" },
              null
            ]
          }
        ],
        [
          { "->": ".^.b" },
          {
            "b": [
              "\n",
              { "->": "twowomjustdomsex" },
              { "->": ".^.^.^.29" },
              null
            ]
          }
        ],
        "nop",
        "\n",
        { "#f": 1 }
      ],
      "twowomsuperdomsex": [
        [
          "^“Donna…” I say and she turns to me for a moment. “Lose your jeans and panties… I want you to play with yourself as you eat out Liz,” I say confidently.",
          "\n",
          "^She smiles and quickly gets out of her clothes. Her hand strays between her legs as she resumes eating Liz’s pussy.",
          "\n",
          "^Fuck me what a sight. I am so aroused but I don’t want proper action yet. I want to watch some more… but that doesn’t mean I can’t make things spicier.",
          "\n",
          "^I get to my feet and move to Donna, reaching down to caress her butt.",
          "\n",
          "^“Get on all fours,” I whisper into her ear and I feel her shudder in anticipation. But no, I don’t intend to do that just yet… she has to earn to be fucked by this cock.",
          "\n",
          "^SLAP! SLAP!",
          "\n",
          "^I start spanking her lovely round butt, both women moaning in approval, Liz especially. I can tell she loves these domination games.",
          "\n",
          "^SLAP! SLAP!",
          "\n",
          "^Their moans become more urgent and I can see they are both getting close as I continue to spank the sexy ass in front of me.",
          "\n",
          "^“You can’t cum yet…” I lean to whisper into Donna’s ear.",
          "\n",
          "^“Ohhh, fuck…” she coos, her hands clenching. She struggles to obey but I give her a harsh spank and she yelps, retracting her hand.",
          "\n",
          "^“Come on babe… make me cum…” Liz purrs, rubbing her pussy all over Donna’s lips.",
          "\n",
          "^SLAP!  SLAP! SLAP!",
          "\n",
          "^The sound of spanking echoes throughout the room as Liz finally screams in orgasm, her legs twitching and squeezing Donna’s head.",
          "\n",
          "^“Fuuuck! I am comiiing!” she cries out, riding out her orgasm on the brunette’s tongue. Donna laps at her pussy hungrily, her hand twitching, but she doesn’t dare to rub herself off.",
          "\n",
          "^As Liz settles down from her climax, I start caressing Donna’s reddened ass.",
          "\n",
          "^“That was a fantastic show,” I say, smiling down at Donna. “You have a talented mouth… and I want to feel it on my cock,” I say, working my shaft slowly. Donna’s eyes stray towards my cock and I see her licking her lips.",
          "\n",
          "^She shuffles forward and sticks her tongue out, swiping it from my balls to the tip of my cock, her eyes fixated on mine.",
          "\n",
          "^“Fuck yeah…” I moan as she finally takes the cockhead in her warm mouth. She flicks her tongue on my glans playfully. She is just getting warmed up. Meanwhile, Liz rises to her feet and joins us, her lips finding mine. She caresses Donna’s hair lovingly, urging her face towards my cock.",
          "\n",
          "^“Liz… I’d like to feel your tongue on my balls…” I say looking her in the eyes. She raises her eyebrow. She is clearly used to giving orders rather than receiving them… but she smirks at me and goes to her knees anyway. A second later, I feel her hot breath on my balls followed by her soft tongue.",
          "\n",
          "^“Holy fuck…” I rasp as they both start working my cock with their hands and mouths.",
          "\n",
          "^What an incredible feeling… Donna keeps sucking my cock, taking more of it into her mouth but unable to go past the midpoint. But fuck me, it’s overkill even as it is. My body is brimming with pent-up arousal.",
          "\n",
          "^“Donna… ahhh… I want to see you rub yourself.”",
          "\n",
          "^“Mmmgh…”",
          "\n",
          "^I can sense joy in her moan, muffled as it is by the cock that is clogging her mouth. Her hand finds her pussy again and she starts rubbing herself vigorously, the intensity of her rubbing closely matched by the intensity of her sucking.",
          "\n",
          "^“Yeah, suck it baby…” Liz purrs, her tongue slobbering all over my balls. Damn, as heavenly as this all feels, there is no way I can last long. Donna is clearly close to cumming and she starts sucking me vigorously, her other hand working my shaft.",
          "\n",
          "^“Mhhmm… MmmhhmmFF!!” Donna gurgles around my cock as her orgasm hits her. The sight of it precipitates my own climax and I howl in joy like a madman.",
          "\n",
          "ev",
          "str",
          "^I cum in Donna's mouth",
          "/str",
          "/ev",
          { "*": ".^.c-0", "flg": 20 },
          "ev",
          "str",
          "^I paint both their faces",
          "/str",
          "/ev",
          { "*": ".^.c-1", "flg": 20 },
          {
            "c-0": [
              "\n",
              "^“FUUCK!” I cry out, grabbing Donna’s head and keeping her mouth glued to my cock as I spurt rope after rope of hot cum inside her mouth. Her eyes bulge and I see her struggle to swallow properly as her own orgasm is racking her body. Bits of it go out of her nose but she manages to take it all down like a good soldier.",
              "\n",
              "^“Holy shit…” Liz says, kissing Donna’s neck lovingly.",
              "\n",
              "^“Yeah, she was great… you both were,” I say, working my shaft and squeezing the last drops onto Donna’s tongue. She swallows, managing a smile. I caress her face, smiling down at her. What a great fucking way to blow my load.",
              "\n",
              "^“You sure do cum a lot…” Donna says with a small burp and we all burst laughing. Liz gets to her feet, her hand caressing Donna's face.",
              "\n",
              { "->": "twowomsuperdomsex2" },
              { "#f": 5 }
            ],
            "c-1": [
              "\n",
              "^“FUUCK!” I cry out as I take my cock out of Donna’s mouth and I work my shaft furiously, my cum spurting all over Donna’s face. She moans and screams in joy as her body convulses in orgasm, my cum covering her lips and eyes. She licks her lips, savoring my cum and demanding more but I turn quickly, painting Liz’s face with my last two ropes of cum. Liz recoils slightly but smiles at me anyway.",
              "\n",
              "^“Damn… that was amazing… both of you,” I breathe.",
              "\n",
              "^“Yeah, that was great… and the taste is awesome,” Donna says. Liz gets to her feet and grabs tissues for herself and Donna.",
              "\n",
              { "->": "twowomsuperdomsex2" },
              { "#f": 5 }
            ]
          }
        ],
        { "#f": 1 }
      ],
      "twowomsuperdomsex2": [
        [
          "^“Go get us all another drink babe… and let’s take this to the bedroom,” Liz says looking down at her. Donna complies and soon we are all lying on their bed and drinking beer.",
          "\n",
          "^“That was a great start,” Liz says, running her hand down Donna’s thigh.",
          "\n",
          "^“Oh yeah…” Donna says, turning towards Liz and finding her lips.",
          "\n",
          "^I watch them in silence as their tongues clash, their hands exploring each other’s bodies. Soon enough, sighs and moans fill the room. Things are heating up once again.",
          "\n",
          "^“Liz… my cock would appreciate exploring your mouth for a bit,” I say with a confident smirk, my semi-erect cock in my hand.",
          "\n",
          "^“I love your cockiness,” Liz says, shaking her head, “even though I rarely dance to other people’s tune.”",
          "\n",
          "^She grabs my cock in her hand and squeezes it lightly but I just give her a smug expression. She laughs and then takes my cock in her mouth, sending me immediately to cloud nine. Fuck… she is definitely more skilled than Donna. Speaking of Donna, I see her moving to lick Liz’s pussy, extending her tongue and swiping all over the blonde’s labia.",
          "\n",
          "^“Donna, why don’t you give some love to the other hole… it might come in handy,” I say, keeping one eye on Liz.",
          "\n",
          "^Her eyebrows shoot up but then she laughs. “You smug fucker… fuck yeah. Lick my ass, Donna,” she says, pulling the younger woman’s head between her firm buttocks.",
          "\n",
          "^“Oh fuck… this is so dirty,” Donna purrs, her tongue flicking across Liz’s rosebud. Liz arches her hips in response, sticking out her amazing ass even more.",
          "\n",
          "^“Yeah… eat my ass baby… show me what that lovely tongue can do,” Liz purrs and then takes more of my cock inside her mouth. She gives me a smoldering look and then engulfs my cock and… oh fuck… she takes it inside her throat.",
          "\n",
          "^“Holy shit!” I croak, the tightness of her throat making my arousal skyrocket.",
          "\n",
          "^“Bwuahh!” Liz pulls my cock out and smirks. Well, I know what that look means. She wanted to tease me, to show me what she could do, and nothing more than that… But if this night stretches out, who knows? I smile at the idea.",
          "\n",
          "^“Babe, your tongue is fantastic, but I am going to need proper lube for this cock,” Liz says, and Donna immediately starts rummaging through the drawers.",
          "\n",
          "^“Found it!” Donna says and rubs some of it on her hands, and then applies it all over my hard cock. She puts some lube on the tip of her finger and pushes it inside Liz’s anus.",
          "\n",
          "^“Fantastic,” I say, stealing a kiss from Donna and then biting her nipples gently. She moans so sweetly.",
          "\n",
          "^“It’s time to give that ass a ride,” I say, pulling away from Donna and aiming my cock at Liz who is waiting for me on all fours. Fuck me, what a sight. Her ass is so firm and toned, yet fleshy. I am going to love this.",
          "\n",
          "^“Here it comes,” I say, grunting as I slowly press my cock into her rosebud.",
          "\n",
          "^“Ohhh… Fuck!” Liz cries out as my cockhead pushes through.",
          "\n",
          "^“Fuck me, how tight is this ass,” I blurt out, feeling as if my cock has been put in a vice… a vice made in heaven. Holy shit, this sensation… I start pumping into her slowly, her moans and sighs only urging me forward. I latch onto her buttocks, squeezing them and caressing the tight skin.",
          "\n",
          "^“Huh… this is so fucking hot,” I hear Donna say. She shuffles on the bed, as if searching for an angle and then she just slides underneath Liz, her tongue finding the blonde’s pussy.",
          "\n",
          "^“Ahhh! I fucking love you, babe…” Liz moans, a shudder going through her body. Donna laughs and then resumes licking Liz’s pussy, occasionally moving up to bathe my balls in her saliva…",
          "\n",
          "^Fuck it, I am too aroused to be able to last long. I pick up my tempo and Liz quickly responds, her butt meeting my crotch in loud slaps. She has it as bad as me… well, probably worse. Donna’s hot tongue is flicking her clit and drinking her juices, and she can’t stop moaning as our bodies slam into each other with increasing speed and force.",
          "\n",
          "^“Oh fuck, I need to fucking cum,” I hiss through my teeth but then I feel Liz’s body shudder violently.",
          "\n",
          "^“AAAHH!! FUCK!” she screams, her body convulsing, her ass milking my cock with vengeance. “YESS! Drink me, babe, Ahhh!!” Liz cries out, her moans and cries interspersed only with my urgent grunts and Donna’s laughter.",
          "\n",
          "^Fuck me, I can’t take any more of this… My balls churn, my cock swelling as much as possible in the tight confines of Liz’s ass. I feel the wonderful tingling in my cock and I know I am about to erupt.",
          "\n",
          "ev",
          "str",
          "^I blow my cum inside Liz's ass",
          "/str",
          "/ev",
          { "*": ".^.c-0", "flg": 20 },
          "ev",
          "str",
          "^I paint her bottocks and her back",
          "/str",
          "/ev",
          { "*": ".^.c-1", "flg": 20 },
          {
            "c-0": [
              "\n",
              "^“Here it comes! AHH!! FUUUCK!!”",
              "\n",
              "^My cock sprays the inside of Liz’s ass with my hot cum, her bowel muscles milking my cock with great intensity. The feeling is simply incredible.",
              "\n",
              "^“Fuck fuck fuuuck! This ass is amazing!” I keep blabbering as I twitch and convulse, trying to ram my cock deeper inside Liz’s bowels than is physically possible. I have a feeling that not a drop of cum is left inside my balls.",
              "\n",
              "^“Ahhh… yeah,” I sigh finally, suddenly feeling completely drained of both cum and energy.",
              "\n",
              "^“I feel like there was a firehose inside my ass,” Liz says chuckling. “Fuck, that was amazing…” she says, looking down at Donna whose eyes are still fixated on my cock and Liz’s ass.",
              "\n",
              "^“Mmmm… babe, what do you say about cleaning us up a bit,” Liz says, biting her lip. She rubs Donna’s pussy with her hand, the brunette responding with an eager moan.",
              "\n",
              "^“Huh… okay.”",
              "\n",
              "^Fuck. I pull out, my cock coming out with a faint pop. Dona slides up and opens her mouth and I oblige eagerly. Her warm mouth sucks my soiled cock, the touch of her tongue on my sensitive glans making me twitch.",
              "\n",
              "^“And now me…” Liz says in a raspy voice, lowering her butt towards Donna’s face. She clenches her anus and pushes out my cum into Donna’s waiting mouth as her fingers keep working the shaved pussy beneath her.",
              "\n",
              "^“Oh fuck me…” Liz purrs as Donna’s tongue flicks over her rosebud, cleaning her. It’s good I feel so drained, otherwise I would blow again at the hotness of the sight.",
              "\n",
              { "->": "twowomsuperdomsexend" },
              { "#f": 5 }
            ],
            "c-1": [
              "\n",
              "^“Here it comes! AHH!! FUUUCK!!”",
              "\n",
              "^I pull my cock just in time and I spray Liz’s buttocks and back with my hot cum, rubbing my swollen cock between the two firm globes. The feeling is simply incredible.",
              "\n",
              "^“Fuck fuck fuuuck!” I keep blabbering as I twitch and convulse, my cock spurting endlessly. I have a feeling that not a drop of cum is left inside my balls.",
              "\n",
              "^“Ahhh… yeah,” I sigh finally, suddenly feeling completely drained of both cum and energy.",
              "\n",
              "^“Holy fuck, what a ride… and what a tongue,” Liz says chuckling. “That was amazing…” she says, looking down at Donna whose eyes are still fixated on my cock and Liz’s ass.",
              "\n",
              "^“Mmmm… babe, what do you say about cleaning us up a bit,” Liz says, biting her lip. She rubs Donna’s pussy with her hand, the brunette responding with an eager moan.",
              "\n",
              "^“Huh… okay.”",
              "\n",
              "^Fuck. Dona slides up and opens her mouth and I offer her my cock. Her warm mouth sucks the rest of the cum out of it, the touch of her tongue on my sensitive glans making me twitch.",
              "\n",
              "^“And now me…” Liz says in a raspy voice. Donna gets out from underneath her and starts licking Lizz’s buttocks and back, scooping the cum with her tongue and swallowing. Liz watches her in amusement.",
              "\n",
              "^“Oh fuck me…” Liz purrs as Donna’s tongue flicks over her rosebud, cleaning her. It’s good I feel so drained, otherwise I would blow again at the hotness of the sight.",
              "\n",
              { "->": "twowomsuperdomsexend" },
              { "#f": 5 }
            ]
          }
        ],
        { "#f": 1 }
      ],
      "twowomsuperdomsexend": [
        "^“You were so fucking great babe… I’ll make it up to you. We both will,” Liz says, looking at me.",
        "\n",
        "^“We sure will. I am going to fuck that lovely pussy of yours for an hour at least.”",
        "\n",
        "^“About fucking time!” Donna says, making us all burst into laughter.",
        "\n",
        "^“Don’t worry babe, there is plenty of this night left still…”",
        "\n",
        "^And fuck me, she is right.",
        "\n",
        "^THE END.",
        "\n",
        "done",
        { "#f": 1 }
      ],
      "twowomjustdomsex": [
        [
          "^“Donna…” I say and she turns to me for a moment. “Lose your jeans and panties… I want you to play with yourself as you lick Liz,” I say confidently.",
          "\n",
          "^She smiles and quickly gets out of her clothes. Her hand strays between her legs as she resumes eating Liz’s pussy.",
          "\n",
          "^Fuck me what a sight. I am so aroused but I don’t want proper action yet. I want to watch some more… but that doesn’t mean I can’t make things spicier.",
          "\n",
          "^I get to my feet and move to Donna, reaching down to caress her butt.",
          "\n",
          "^“Get on all fours,” I whisper into her ear and I feel her shudder in anticipation. But no, I don’t intend to do that just yet… she has to earn to be fucked by this cock.",
          "\n",
          "^SLAP! SLAP!",
          "\n",
          "^I start spanking her lovely round butt, both women moaning in approval, Liz especially. I can tell she loves these domination games.",
          "\n",
          "^SLAP! SLAP!",
          "\n",
          "^Their moans become more urgent and I can see they are both getting close as I continue to spank the sexy ass in front of me.",
          "\n",
          "^“You can’t cum yet…” I lean to whisper into Donna’s ear.",
          "\n",
          "^“Ohhh, fuck…” she coos, her hands clenching. She struggles to obey but I give her a harsh spank and she yelps, retracting her hand.",
          "\n",
          "^“Come one babe… make me cum…” Liz purrs, rubbing her pussy all over Donna’s lips.",
          "\n",
          "^SLAP!  SLAP! SLAP!",
          "\n",
          "^The sounds of spanking echo throughout the room as Liz finally screams in orgasm, her legs twitching and squeezing Donna’s head.",
          "\n",
          "^“Fuuuck! I am comiiing!” she cries out, riding out her orgasm on the brunette’s tongue. Donna laps at her pussy hungrily, her hand twitching, but she doesn’t dare to rub herself off.",
          "\n",
          "^As Liz settles down from her climax, I start caressing Donna’s reddened ass.",
          "\n",
          "^“That was a fantastic show,” I say, smiling down at Donna. “You have a talented mouth… and I want to feel it on my cock,” I say, working my shaft slowly. Donna’s eyes stray towards my cock and I see her licking her lips.",
          "\n",
          "^She shuffles forward and sticks her tongue out, swiping it from my balls to the tip of my cock, her eyes fixated on mine.",
          "\n",
          "^“Fuck yeah…” I moan as she finally takes the cockhead in her warm mouth. She flicks her tongue on my glans playfully. She is just getting warmed up. Meanwhile, Liz rises to her feet and joins us, her lips finding mine. She caresses Donna’s hair lovingly, urging her face towards my cock.",
          "\n",
          "^“Suck that cock baby… suck it,” Liz says, turning to kiss me on the lips. Our tongues clash in a passionate struggle as Donna’s tongue swirls all over my cockhead.",
          "\n",
          "^“Ahhh… her mouth feels so fucking good…” I moan as Liz breaks our kiss.",
          "\n",
          "^“Oh, I know… but let’s give her more incentive,” Liz says, going behind Donna. She puts her foot between Donna’s legs and starts working the brunette’s pussy with her toes.",
          "\n",
          "^“Mmmffgh!” Donna moans, her body shuddering in pleasure. “Yeah baby, do me with your foot…” she purrs, taking my cock back in her mouth and sucking with even more vigor. I can feel the urgency in her sucking as Liz’s foot is working her pussy at a furious pace.",
          "\n",
          "^What an incredible feeling… Donna keeps sucking my cock, taking more of it into her mouth but unable to go past the midpoint. But fuck me, my body is brimming with pent-up arousal and I am already close to cumming.",
          "\n",
          "^“You like fucking that foot, don’t you, you little slut…” Liz says, working her foot faster. Donna starts rocking her hips, trying to hump the foot that’s giving her so much pleasure. I can tell she is on the verge of orgasm…",
          "\n",
          "^“Mhhmm… MmmhhmmFF!!” Donna gurgles around my cock as her orgasm finally hits her. The sight of it precipitates my own climax and I howl in joy like a madman.",
          "\n",
          "^“FUUCK!” I cry out as I take my cock out of Donna’s mouth and I work my shaft furiously, my cum spurting all over Donna’s face. She moans and screams in joy as her body convulses in orgasm, my cum covering her lips and eyes. She licks her lips, savoring my cum and demanding more and I give her all I have. The last two spurts end up in her mouth and she swallows them with a satisfied smile.",
          "\n",
          "^“Fuck, that was really something,” Liz exclaims when we both settle down.",
          "\n",
          "^“Oh yeah… it was. Your cum tastes great,” Donna says, her smile looking great even painted white as she was.",
          "\n",
          "^“You are such a little slut, aren’t you…” Liz says lovingly. “Well, then clean my foot… lick it clean of your nasty juices,” Liz adds with a smirk.",
          "\n",
          "^“God, yes…” she purrs and takes the proffered foot, running her tongue all over the sole and sucking the toes.",
          "\n",
          "^Liz and I laugh at the sight of her slobbering, but I must say the image is quite an arousing one, even if I just blew my load.",
          "\n",
          "^“Now go get us all another drink babe… and then let’s take this to the bedroom,” Liz says looking down at her. Donna complies and soon we are all lying on their bed and drinking beer.",
          "\n",
          "^“That was a great start,” Liz says, running her hand down Donna’s thigh.",
          "\n",
          "^“Oh yeah…” Donna says, turning towards Liz and finding her lips.",
          "\n",
          "^I watch them in silence as their tongues clash, their hands exploring each other’s bodies. Soon enough, sighs and moans fill the room. Things are heating up once again.",
          "\n",
          "^“Let’s try to make this more fun…”",
          "\n",
          "^They both look at me quizzically.",
          "\n",
          "^“Donna,  get on all fours.”",
          "\n",
          "^“All right…” Donna says and goes to her hands and knees in the middle of the bed. I can’t help marveling at her curvy body.",
          "\n",
          "^“Liz…” I say, patting Donna’s back.",
          "\n",
          "^Liz laughs. “Fuck, that’s an idea,” she says, lying on top of Donna on her back. “You are so deliciously soft and warm, baby… Am I too heavy?”",
          "\n",
          "^“Nah… your ass could be softer though…” Donna says with a chuckle.",
          "\n",
          "^“You bitch,” Liz laughs.",
          "\n",
          "^“All right girls…” I say, taking my time to gorge my eyes on the beautiful sight. Two lovely bodies, two sweet pussies on top of each other… Fuck, yeah.",
          "\n",
          "^I lean down and begin swiping my tongue from one delicious pussy to the other, tasting them, savoring them, while I work my shaft slowly. Not that it takes long for me to get hard with this lovely display of bodies. Liz’s position is a bit awkward so I put her feet on my shoulders and hold them there, taking my time to caress and kiss her calves, and getting a sigh of appreciation in response. It’s time for action though.",
          "\n",
          "^Taking one last swipe with my tongue, I push my cock inside Donna’s pussy. It slides in perfectly.",
          "\n",
          "^“Fuck… I love your pussy…” I say and Donna just moans in reply. I start fucking her slowly, just enjoying myself, while Liz is watching me with curiosity. She starts caressing my chest with her feet, rubbing my nipples, until she decides to push her toes inside my mouth. I suck on her toes vigorously and she gives me a satisfied smirk.",
          "\n",
          "^Okay, let’s give her something more than that. I pull out of Donna and slide inside Liz’s pussy, and fuck, she feels even tighter… She moans hard as I start fucking her pussy, her feet roaming restlessly all over my body. I pull out soon enough and smirk at her disappointment as my cock finds Donna’s pussy once again.",
          "\n",
          "^Our lusty moans fill the room as this rhythm continues for a while, me switching between two tight pussies and trying not to come too soon, as hard as that is. But I want them to come first.",
          "\n",
          "^I pull out of Donna and push inside Liz’s tightness, picking up my pace. Then I reach down and push three fingers inside Donna, starting to fuck her with my hand. Damn, this feels so good. I work my hips and my hand, our sighs and moans becoming continuous… Fuck it, let’s see who cums first.",
          "\n",
          "^I start slamming into Liz, my crotch clashing against both lovely bodies. Sweat starts pouring out of me as I fuck Liz vigorously, my hand inside Donna’s pussy a fucking blur. And the first screams of climax are soon there…",
          "\n",
          "^“Ahhh!! fuuck! I’m cummiiing!” Dona cries out, signaling that my hand is the victor. She gushes on my fingers, her body shivering in climax and threatening to collapse beneath Liz.",
          "\n",
          "^Luckily, she manages to stay on all fours, and I pull my fingers out of her pussy and push them inside Liz’s mouth, the taste of them the aphrodisiac that precipitates her own orgasm…",
          "\n",
          "^“MMMGFH! Ahhh! I love your taste, babeee!!” Liz screams as she convulses in orgasm, her pussy clenching around my cock. Holy shit, I am not going to last ten seconds… I give my best to let Liz ride her orgasm out before I know my own can’t be postponed any longer. The tingling sensation in my cock tells me I am about to erupt.",
          "\n",
          "ev",
          "str",
          "^I cum on Liz's pussy",
          "/str",
          "/ev",
          { "*": ".^.c-0", "flg": 20 },
          "ev",
          "str",
          "^I paint her tits instead",
          "/str",
          "/ev",
          { "*": ".^.c-1", "flg": 20 },
          {
            "c-0": [
              "\n",
              "^I pull out at the last moment, rubbing my cockhead against Liz’s trimmed triangle.",
              "\n",
              "^“NNGHH! AHH!! Two pussies with one cooock!” I roar like a madman as I spurt my cum all over Liz’s pubic area, some of it leaking all over her vulva. My body twitches and contracts as I empty my balls, beads of sweat forming all over my smiling face.",
              "\n",
              "^“Fuck yeah!” I growl as they both laugh at my silly boasting.",
              "\n",
              "^I slump to the bed, breathing hard, as Liz slides down to the bed as well.",
              "\n",
              "^“This was fantastic…” Donna purrs, lying next to us.",
              "\n",
              "^“Yeah… you girls are awesome,” I say between breaths.",
              "\n",
              "^“Oh, you haven’t seen anything yet,” Liz says laughing.",
              "\n",
              "^“Yeah, we should definitely continue,” Donna says eagerly.",
              "\n",
              "^“Of course babe… but you should probably clean me up first…” Liz says giving her a seductive look. Donna looks at her quizzically and then chuckles.",
              "\n",
              "^“You know I can’t say no to your pussy…” Donna says, moving down between Liz’s legs and swiping her tongue over Liz’ vulva, scooping my cum and swallowing.",
              "\n",
              { "->": "twowomjustdomsexend" },
              { "#f": 5 }
            ],
            "c-1": [
              "\n",
              "^I pull out at the last moment, shuffling up and jerking my cock between Liz’s tits",
              "\n",
              "^“NNGHH! AHH!! Two pussies with one cooock!” I roar like a madman as I spurt my cum all over Liz’s chest, covering her purple nipples in white. My body twitches and contracts as I empty my balls, beads of sweat forming all over my smiling face.",
              "\n",
              "^“Fuck yeah!” I growl as they both laugh at my silly boasting.",
              "\n",
              "^I slump to the bed, breathing hard, as Liz slides down to the bed as well.",
              "\n",
              "^“This was fantastic…” Donna purrs, lying next to us.",
              "\n",
              "^“Yeah… you girls are awesome,” I say between breaths.",
              "\n",
              "^“Oh, you haven’t seen anything yet,” Liz says laughing.",
              "\n",
              "^“Yeah, we should definitely continue,” Donna says eagerly.",
              "\n",
              "^“Of course babe… but you should probably clean me up first…” Liz says giving her a seductive look. Donna looks at her quizzically and then chuckles.",
              "\n",
              "^“You know I can’t say no to your tits, baby…” Donna says, leaning down and swiping her tongue over Liz’s chest, her tongue flicking over Liz’s nipples and sucking my cum off of them.",
              "\n",
              { "->": "twowomjustdomsexend" },
              { "#f": 5 }
            ]
          }
        ],
        { "#f": 1 }
      ],
      "twowomjustdomsexend": [
        "^Holy fuck, I have a feeling that this night is only going to get better…",
        "\n",
        "^THE END.",
        "\n",
        "done",
        { "#f": 1 }
      ],
      "lady": [
        [
          "^\"I'm Amanda.\"",
          "\n",
          "^“Paul,” I reply, smiling. As I think about my next line, I give her an appraising look. She must be in her mid to late forties, but she is still a beautiful woman. Long dark hair, a striking face, and judging by what I could glimpse while walking to the table, she has some really nice curves.",
          "\n",
          "ev",
          "str",
          "^I ask why she is alone",
          "/str",
          "/ev",
          { "*": ".^.c-0", "flg": 20 },
          "ev",
          "str",
          "^I do some smalltalk",
          "/str",
          "/ev",
          { "*": ".^.c-1", "flg": 20 },
          "ev",
          "str",
          "^I take a sip of wine and let her steer the conversation",
          "/str",
          "/ev",
          { "*": ".^.c-2", "flg": 20 },
          {
            "c-0": [
              "\n",
              "ev",
              { "VAR?": "dom" },
              1,
              "+",
              "/ev",
              { "VAR=": "dom", "re": true },
              "^“So, Amanda… I can’t wrap my head around the idea of a beautiful woman like you sitting alone in a bar. There has to be something special about it.”",
              "\n",
              "^She just looks at me for a few moments as if trying to get inside my head. Then she smiles.",
              "\n",
              "^“Good guess. I am celebrating divorce,” she says raising her glass in a toast. I raise mine.",
              "\n",
              { "->": "lady2" },
              { "#f": 5 }
            ],
            "c-1": [
              "\n",
              "^“I guess it would make sense to say that you are not a regular here,” I ask.",
              "\n",
              "^“No. It’s a nice place but not among those I usually frequent. I am celebrating tonight.”",
              "\n",
              "^“If you don’t mind me saying, very few things are celebrated alone.”",
              "\n",
              "^“Touché,” she says with a chuckle. “I am celebrating my divorce.”",
              "\n",
              "^So she is free now. I try not to show how happy that makes me.",
              "\n",
              { "->": "lady2" },
              { "#f": 5 }
            ],
            "c-2": [
              "\n",
              "ev",
              { "VAR?": "dom" },
              1,
              "-",
              "/ev",
              { "VAR=": "dom", "re": true },
              "^“Let me guess, you are wondering why I am all alone tonight,” she says after a moment.",
              "\n",
              "^“Well, it did cross my mind,” I reply with a smile.",
              "\n",
              "^“I’m celebrating freedom!” she says, chuckling.",
              "\n",
              "^“You are getting a divorce?”",
              "\n",
              "^“All finished,” she says cheerfully. I try to match her mood.",
              "\n",
              { "->": "lady2" },
              { "#f": 5 }
            ]
          }
        ],
        { "#f": 1 }
      ],
      "lady2": [
        [
          "^“To divorce and all the good things it leads to,” I say. She nods appreciatively.",
          "\n",
          "^“Do you want to talk about it,” I ask tentatively.",
          "\n",
          "^“I appreciate the kindness but there isn’t much to tell. My now ex-husband was fucking his secretary. A cliché,” she says with only a hint of bitterness in her voice.",
          "\n",
          "^“What a fool!” I blurt out.",
          "\n",
          "^She gives me an inquisitive look, and then laughs, seeing the honesty on my face.",
          "\n",
          "^“You really mean that,” she says, smiling.",
          "\n",
          "^“Of course I do. You are so gorgeous.”",
          "\n",
          "^“All right, flatterer,” she says as if swatting it down, but I can tell she loves the compliment. I suddenly wonder if I am taking advantage of her sensitive state.",
          "\n",
          "^She notices the look on my face. “Don’t worry, Paul, I am a big girl and I make all my decisions,” she says with a smirk. How the fuck is she doing that?",
          "\n",
          "^“So… are you a university student, Paul.”",
          "\n",
          "^“Nah, I was done with school after college. I work in IT.”",
          "\n",
          "^Is that relief I am reading on her face? Why does that make any difference, I wonder.",
          "\n",
          "^“You?”",
          "\n",
          "^“Take a guess,” she says, watching me with curiosity.",
          "\n",
          "^“Hmm… You are a medical doctor.”",
          "\n",
          "^She chuckles. “Why do you think that.”",
          "\n",
          "ev",
          "str",
          "^I make a lewd hint",
          "/str",
          "/ev",
          { "*": ".^.c-0", "flg": 20 },
          "ev",
          "str",
          "^I crack a joke about needing a doctor",
          "/str",
          "/ev",
          { "*": ".^.c-1", "flg": 20 },
          "ev",
          "str",
          "^I shyly admit to liking uniforms",
          "/str",
          "/ev",
          { "*": ".^.c-2", "flg": 20 },
          {
            "c-0": [
              "\n",
              "ev",
              { "VAR?": "dom" },
              1,
              "+",
              "/ev",
              { "VAR=": "dom", "re": true },
              "^“Because doctors are so sexy… and you fit the description.”",
              "\n",
              "^“You think?” she says, pretending nonchalance but I could swear she likes my open flirting.",
              "\n",
              { "->": "lady3" },
              { "#f": 5 }
            ],
            "c-1": [
              "\n",
              "^“Well, a guy can hope. You see, there is this pain in my back, and…”",
              "\n",
              "^She laughs, shaking her head.",
              "\n",
              "^“You are terrible,” she says but I can see she is enjoying my company.",
              "\n",
              { "->": "lady3" },
              { "#f": 5 }
            ],
            "c-2": [
              "\n",
              "ev",
              { "VAR?": "dom" },
              1,
              "-",
              "/ev",
              { "VAR=": "dom", "re": true },
              "^“I guess I have a thing for uniforms…” I reply with a sheepish face. She wags her finger at me playfully and her posture changes slightly.",
              "\n",
              "^“For women in uniform, you mean.”",
              "\n",
              "^“Yeah, I guess.”",
              "\n",
              "^“Interesting.”",
              "\n",
              { "->": "lady3" },
              { "#f": 5 }
            ]
          }
        ],
        { "#f": 1 }
      ],
      "lady3": [
        [
          "^\"Anyway, you are way off. I am a university professor.\"",
          "\n",
          "^\"Wow, really?\"",
          "\n",
          "^\"Yes, no kidding.\"",
          "\n",
          "^\"What do you teach?\"",
          "\n",
          "^\"Philosophy.\"",
          "\n",
          "^\"Damn... where were professors like you when I was a college student,\" I blurt out and she laughs again.",
          "\n",
          "^\"I am dressed all bookish when I am at work.\"",
          "\n",
          "ev",
          "str",
          "^I flirt some more",
          "/str",
          "/ev",
          { "*": ".^.c-0", "flg": 20 },
          "ev",
          "str",
          "^I ask about her work",
          "/str",
          "/ev",
          { "*": ".^.c-1", "flg": 20 },
          "ev",
          "str",
          "^I am in awe",
          "/str",
          "/ev",
          { "*": ".^.c-2", "flg": 20 },
          {
            "c-0": [
              "\n",
              "ev",
              { "VAR?": "dom" },
              1,
              "+",
              "/ev",
              { "VAR=": "dom", "re": true },
              "^“I bet you look incredible even in modest clothing… You can totally pull off a librarian’s looks. Tell me that you own a pair of reading glasses, please,” I say, flirting outrageously and offering my most disarming smile.",
              "\n",
              "^“Oh my god, you are incorrigible,” she says, laughing. She has a very melodic laugh and I love hearing it. She takes a sip of wine and then licks her lips.",
              "\n",
              { "->": "lady4" },
              { "#f": 5 }
            ],
            "c-1": [
              "\n",
              "^“Do you like your job? I bet students can be quite annoying… I know I was at least.”",
              "\n",
              "^“I love my job yes. So many keen young minds to keep you on your toes,” she says with an honest smile.",
              "\n",
              "^“Hah! You obviously never taught my class!” I say theatrically and we both laugh. I can see her loosening her inhibitions and she downs her glass, looking at me with hunger. I hurry to refill it.",
              "\n",
              { "->": "lady4" },
              { "#f": 5 }
            ],
            "c-2": [
              "\n",
              "ev",
              { "VAR?": "dom" },
              1,
              "-",
              "/ev",
              { "VAR=": "dom", "re": true },
              "^\"Well, bookish or elegant, it doesn't matter. I would have loved studying under you,” I say honestly. I see her raise her eyebrow as my words come out as too eager. The wine is doing its work on me.",
              "\n",
              "^“Are you sure you don’t mean ‘on top of me’?” she says, smirking.",
              "\n",
              "^“Nope. Definitely under you…” I blurt out and I see her face taking a predatory look.",
              "\n",
              { "->": "lady4" },
              { "#f": 5 }
            ]
          }
        ],
        { "#f": 1 }
      ],
      "lady4": [
        "^Time stretches on as we keep drinking and chatting, our walls coming down bit by bit. I find this mature beauty fascinating and I can’t fathom why would her now ex-husband want to cheat on her. Well, his loss for sure, and hopefully it could be my gain as well.",
        "\n",
        "ev",
        { "VAR?": "dom" },
        0,
        ">",
        "/ev",
        [
          { "->": ".^.b", "c": true },
          { "b": ["\n", { "->": "ladydom" }, { "->": "lady4.8" }, null] }
        ],
        "nop",
        "\n",
        "ev",
        { "VAR?": "dom" },
        0,
        "<=",
        { "VAR?": "dom" },
        -2,
        ">",
        "&&",
        "/ev",
        [
          { "->": ".^.b", "c": true },
          { "b": ["\n", { "->": "ladyneut" }, { "->": "lady4.20" }, null] }
        ],
        "nop",
        "\n",
        "ev",
        { "VAR?": "dom" },
        -2,
        "<=",
        "/ev",
        [
          { "->": ".^.b", "c": true },
          { "b": ["\n", { "->": "ladysub" }, { "->": "lady4.28" }, null] }
        ],
        "nop",
        "\n",
        { "#f": 1 }
      ],
      "ladyneut": [
        [
          "^We talk and we laugh, my gaze never leaving her lovely eyes. Then, I see sudden hesitation on her face, one that is quickly replaced by mischief… and lust. I wait in anticipation, my eyes still locked on her face. Then I feel it. The soft touch of her stockinged foot on my calves, teasing me, caressing me… Oh fuck.",
          "\n",
          "ev",
          "str",
          "^I tell her she is turning me on",
          "/str",
          "/ev",
          { "*": ".^.c-0", "flg": 20 },
          "ev",
          "str",
          "^I let her roam free",
          "/str",
          "/ev",
          { "*": ".^.c-1", "flg": 20 },
          {
            "c-0": [
              "\n",
              "ev",
              { "VAR?": "dom" },
              1,
              "+",
              "/ev",
              { "VAR=": "dom", "re": true },
              "^“Fuck, Amanda… you are turning me on so much,” I say as I look her in the eyes.",
              "\n",
              "^“Manners, young man…” she says playfully.",
              "\n",
              "^“You are one insanely sexy lady, you know that.”",
              "\n",
              "^“I know… but it’s good to hear it anyway,” she says as her foot moves away.",
              "\n",
              { "->": "ladycab" },
              { "#f": 5 }
            ],
            "c-1": [
              "\n",
              "ev",
              { "VAR?": "dom" },
              1,
              "-",
              "/ev",
              { "VAR=": "dom", "re": true },
              "^I look at her, transfixed, as she plays with me, the touch of her foot sending shivers all over my body. She taunts me, her foot going up but stopping before it touches my thighs.",
              "\n",
              "^“Mmm…” she purrs when I finally manage to catch her foot. I tickle her gently, reveling in her laughter. Fuck, I am getting turned on so bad. As if reading my mind, she takes her foot back, and I slowly breathe out…",
              "\n",
              { "->": "ladycab" },
              { "#f": 5 }
            ]
          }
        ],
        { "#f": 1 }
      ],
      "ladysub": [
        [
          "^We talk and we laugh, my gaze never leaving her lovely eyes. Then, I see sudden hesitation on her face, one that is quickly replaced by mischief… and lust. I wait in anticipation, my eyes still locked on her face. Then I feel it. I feel the touch of her high-heeled shoe caressing my calves… and going up.",
          "\n",
          "^I sigh in arousal, my face flushing. Her lusty smirk is unmistakable. Her foot starts to carress my thigh, the roughness of her shoe sole doing little to slow down the rapid hardening of my cock.",
          "\n",
          "ev",
          "str",
          "^I stop her foot and cope her leg",
          "/str",
          "/ev",
          { "*": ".^.c-0", "flg": 20 },
          "ev",
          "str",
          "^I take off her shoe and rub her foot",
          "/str",
          "/ev",
          { "*": ".^.c-1", "flg": 20 },
          "ev",
          "str",
          "^I let her do whatever she wants",
          "/str",
          "/ev",
          { "*": ".^.c-2", "flg": 20 },
          {
            "c-0": [
              "\n",
              "ev",
              { "VAR?": "dom" },
              1,
              "+",
              "/ev",
              { "VAR=": "dom", "re": true },
              "^I grab her ankle, my other hand going up her stockinged leg, our eyes still locked together. She sighs in arousal and I barely stop myself from moaning as my hand reaches the warmth of her lower thigh. Damn it all, I struggle not to rush under the table and caress and touch and kiss and bite the warm, trembling flesh. She retracts her leg suddenly, clearly noticing my struggle. Aroused as she is, she can still keep her head… unlike me, apparently.",
              "\n",
              { "->": "ladycab" },
              { "#f": 5 }
            ],
            "c-1": [
              "\n",
              "^I take hold of her ankle and I take off the shoe, her warm stockinged foot now in my hands. My thumbs press on her soles gently and I see her struggle not to moan in appreciation. But I am even worse off. My cock is hardening with every touch of my fingers on her soft foot, and in my mind, I already see myself taking my cock out and her silky foot rubbing me to climax, my copious cum covering her toes completely. Oh fuck…",
              "\n",
              "^Does she see how far gone I am? Probably, because her foot disappears from my hand and I release a sigh of relief.",
              "\n",
              { "->": "ladycab" },
              { "#f": 5 }
            ],
            "c-2": [
              "\n",
              "ev",
              { "VAR?": "dom" },
              1,
              "-",
              "/ev",
              { "VAR=": "dom", "re": true },
              "^I feel powerless to react and resist, and I let her have free reign over me. Her foot keeps going up, pushing my legs apart, the hard touch of her shoe sole on my thigh only increasing the blood flow into my cock. My breath quickens as her foot keeps coming closer and closer, her domineering, lusty gaze now fixated on my face. Oh fuck oh fuck…",
              "\n",
              "^Ahh! I barely stop myself from crying out as her foot lands on my balls and my rock-hard shaft. She smirks at me as she keeps pressing, her hard sole exerting complete dominance over my cock. Fuck me, I will erupt in a matter of seconds if she starts rubbing my cock with her foot. Fuck… I can’t… and then it’s suddenly gone.",
              "\n",
              "^A long and tortured breath comes out of me with the departure of my tormentor. I both curse my luck and thank god that she knew when to stop. I was so far gone. As I manage to calm myself I look at her and mouth a silent 'thank you'",
              "\n",
              { "->": "ladycab" },
              { "#f": 5 }
            ]
          }
        ],
        { "#f": 1 }
      ],
      "ladydom": [
        [
          "^I take a look at the wine bottle and I see there's barely any wine left in it. I am about to order another one when she reaches out with her hand and starts caressing mine.",
          "\n",
          "ev",
          "str",
          "^I kiss her hand",
          "/str",
          "/ev",
          { "*": ".^.c-0", "flg": 20 },
          "ev",
          "str",
          "^I hold her hand tight",
          "/str",
          "/ev",
          { "*": ".^.c-1", "flg": 20 },
          "ev",
          "str",
          "^I let her guide me",
          "/str",
          "/ev",
          { "*": ".^.c-2", "flg": 20 },
          {
            "c-0": [
              "\n",
              "ev",
              { "VAR?": "dom" },
              1,
              "+",
              "/ev",
              { "VAR=": "dom", "re": true },
              "^I bring her hand to my lips and I kiss it sensually, her soft skin feeling great on my lips. She releases a passionate sigh, almost a moan and I see in her eyes that we want the same thing.",
              "\n",
              "^“Let’s finish what’s left of the wine and then… then we can order another bottle, or we can get out of here,” I say, planting another kiss on her hand.",
              "\n",
              { "->": "ladycab" },
              { "#f": 5 }
            ],
            "c-1": [
              "\n",
              "^I hold her hand tightly. Her hand is warm and soft and I look at her to reassure her that I feel the same way. I want her.",
              "\n",
              "^“What now?” I ask, looking at the almost empty wine bottle.",
              "\n",
              { "->": "ladycab" },
              { "#f": 5 }
            ],
            "c-2": [
              "\n",
              "ev",
              { "VAR?": "dom" },
              1,
              "-",
              "/ev",
              { "VAR=": "dom", "re": true },
              "^I let her caress my hand and smile back at her. I want her to know that we can do this at her own pace, no pressure. She can decide how far this will go.",
              "\n",
              "^She takes a look at the wine bottle and seemingly reaches a decision.",
              "\n",
              "^\"Shall I order another one?\"",
              "\n",
              { "->": "ladycab" },
              { "#f": 5 }
            ]
          }
        ],
        { "#f": 1 }
      ],
      "ladycab": [
        [
          "^She smiles at me. “Let’s go to my place.”",
          "\n",
          "^“No kids?” I ask.",
          "\n",
          "^“They are both away at university. They didn’t want to go their mom’s university, apparently,” she says with a chuckle.",
          "\n",
          "^“Great!”",
          "\n",
          "^We down the rest of the wine quickly and hail a cab. We both take our places at the back seat, our thighs lightly touching.",
          "\n",
          "ev",
          "str",
          "^I take her hand",
          "/str",
          "/ev",
          { "*": ".^.c-0", "flg": 20 },
          "ev",
          "str",
          "^I caress her thigh",
          "/str",
          "/ev",
          { "*": ".^.c-1", "flg": 20 },
          "ev",
          "str",
          "^I sit back and relax",
          "/str",
          "/ev",
          { "*": ".^.c-2", "flg": 20 },
          {
            "c-0": [
              "\n",
              "^I take her hand and squeeze it lightly. I want her to feel my desire. She smiles without looking at me, her head reclining, her eyes closed. The ride isn’t too long and we soon find ourselves in front of her house.",
              "\n",
              { "->": "ladysex" },
              { "#f": 5 }
            ],
            "c-1": [
              "\n",
              "ev",
              { "VAR?": "dom" },
              1,
              "+",
              "/ev",
              { "VAR=": "dom", "re": true },
              "^I start caressing her leg, my fingers trying to get inside the skirt. I want to touch the warm flesh of her inner thigh so bad. I want to fuck her right here, right now. Her face flushes as I tease her mercilessly, but I am probably worse off.",
              "\n",
              "^The longest ride of my life finally ends and we reach her house. We get out of the car and I take a look at the house.",
              "\n",
              { "->": "ladysex" },
              { "#f": 5 }
            ],
            "c-2": [
              "\n",
              "ev",
              { "VAR?": "dom" },
              1,
              "-",
              "/ev",
              { "VAR=": "dom", "re": true },
              "^I recline and close my eyes and soon I feel her hand roaming through my hair, touching my neck, and then finding my lips. Her finger slips inside my mouth, and I suck on it, feeling torn between arousal and embarrassment. Luckily, the driver shows no reaction. The guy has probably seen much worse.",
              "\n",
              "^We reach our destination and finally get out of the car. I glance at the house as she walks to the doors, taking out her key.",
              "\n",
              { "->": "ladysex" },
              { "#f": 5 }
            ]
          }
        ],
        { "#f": 1 }
      ],
      "ladysex": [
        "^Damn, she seems to be well off. We get inside quickly, both of us in anticipation of what is to come.",
        "\n",
        "ev",
        { "VAR?": "dom" },
        0,
        "<",
        "/ev",
        [
          { "->": ".^.b", "c": true },
          { "b": ["\n", { "->": "ladysubsex" }, { "->": ".^.^.^.9" }, null] }
        ],
        [
          { "->": ".^.b" },
          { "b": ["\n", { "->": "ladydomsex" }, { "->": ".^.^.^.9" }, null] }
        ],
        "nop",
        "\n",
        { "#f": 1 }
      ],
      "ladysubsex": [
        "^As soon as the door closes behind us, she pulls me in for a kiss. And fuck, she is a great kisser. I struggle to take a breath as her tongue invades my mouth, marking its territory. As we kiss, our hands roam all over each other’s bodies. I feel consumed by the need to touch her bare flesh and I go for her dress but she stops me.",
        "\n",
        "^“Not so fast, loverboy…” she says, pushing me away and looking at me seductively. “I want you to strip first. Give me a good show,” she says, sitting on the sofa and crossing her legs.",
        "\n",
        "^I take a deep breath and go for my shirt, swaying my body and trying to give her some entertainment. I feel awkward but there is something deeply erotic about stripping while under the gaze of a beautiful woman. My shirt is finally gone but at least I’ve nothing to be ashamed about my torso. I keep myself in good shape and I flaunt my muscles theatrically for her enjoyment.",
        "\n",
        "^She smiles first but then starts to cheer in encouragement as I reach for my pants. Fuck me, there is a certain feeling of vulnerability when you strip like this and the other person is still clothed. But I am loving every second of it. The way she is looking at me…",
        "\n",
        "^Before I know it, I am left only in my tight boxers, my semi-erection showing quite obviously. She smiles and beckons me with her finger and I approach eagerly. I am so fucking hungry for her.",
        "\n",
        "ev",
        { "VAR?": "dom" },
        -3,
        "<",
        "/ev",
        [
          { "->": ".^.b", "c": true },
          {
            "b": [
              "\n",
              { "->": "ladysupersubsex" },
              { "->": ".^.^.^.17" },
              null
            ]
          }
        ],
        [
          { "->": ".^.b" },
          {
            "b": ["\n", { "->": "ladyjustsubsex" }, { "->": ".^.^.^.17" }, null]
          }
        ],
        "nop",
        "\n",
        { "#f": 1 }
      ],
      "ladyjustsubsex": [
        [
          "^“It’s time for me to return the favor,” she says, getting up from the sofa. “But I want you to watch me… from your knees,” she says, coming close to me and touching my face.",
          "\n",
          "^The closeness of her body, the scent of her perfume, and the feel of her hot breath on my neck as she leans in, is making my body go haywire. I smile and nod, fully ready for the show… but not before I steal one more kiss. I taste her lips once again, letting her feel my hunger. Then, I sink to my knees and she starts circling me like a predator assessing her prey.",
          "\n",
          "^She taps on her phone to play some jazz music… and then she begins.",
          "\n",
          "^Holy shit. Her body sways so gracefully. The way her hips, her legs move… there is no way she hasn’t done this before. I am beginning to wonder exactly what kind of exotic life this remarkable woman led in her youth. She dances around me, playing with her dress, taking it off oh so slowly…",
          "\n",
          "^My perspective is weird as I am on my knees but it also gives me some incredible angles and it somehow fuels my submissive tendencies. Fuck, she hasn’t even fully unzipped yet but my cock is already trying to rip my boxers. And now, she is taking off her stockings, flashing the bare flesh of her legs. Mmm… she is circling me, touching me, teasing me. She ties the stockings areound my neck… Fuck, it's a leash of a sort, and I cannot be more aroused about it.",
          "\n",
          "^“Come…” she whispers, pulling my leash. And I follow eagerly. She is now wearing only her underwear.",
          "\n",
          "^She sits down on the sofa and gives me a look that says - Your move.",
          "\n",
          "ev",
          "str",
          "^I want her to suck my cock",
          "/str",
          "/ev",
          { "*": ".^.c-0", "flg": 20 },
          "ev",
          "str",
          "^I want to taste her",
          "/str",
          "/ev",
          { "*": ".^.c-1", "flg": 20 },
          "ev",
          "str",
          "^I want to get down on my knees and kiss her feet",
          "/str",
          "/ev",
          { "*": ".^.c-2", "flg": 20 },
          {
            "c-0": [
              "\n",
              "^\"My cock was hurting for the whole time you were doing your strip show... I would like you to give it some attention,\" I say, trying to sound confident, but my confidence crumbles beneath her gaze.",
              "\n",
              "^“Mmm, no… You haven’t earned that yet, and besides, I think ladies come first, don’t you think?” she says, spreading her meaty thighs.",
              "\n",
              "^I smile. “There is no universe in which I would say no to that,” I say, falling to my knees before her once again.",
              "\n",
              { "->": "ladyjustsubsex2" },
              { "#f": 5 }
            ],
            "c-1": [
              "\n",
              "^“I want to taste you, to drink from you…” I say, kneeling before her once again. She smiles at me, her body shuddering in anticipation.",
              "\n",
              { "->": "ladyjustsubsex2" },
              { "#f": 5 }
            ],
            "c-2": [
              "\n",
              "ev",
              { "VAR?": "dom" },
              1,
              "-",
              "/ev",
              { "VAR=": "dom", "re": true },
              "ev",
              { "VAR?": "dom" },
              -3,
              "<",
              "/ev",
              [
                { "->": ".^.b", "c": true },
                {
                  "b": [
                    "\n",
                    "^I feel obsessed about submitting to this amazing woman. I want her to see how fucking hot she is, how much she is pushing my submissive buttons. I fall to my knees and I see her raise an eyebrow in question as I take her feet into my hands.",
                    "\n",
                    "^Oh, my wonderful, submissive boy…” she purrs as I kiss her bare feet and then take her toes in my mouth, sucking, savoring like a madman. She struggles not to rub herself off as I feast on her bare feet, licking and kissing my way up, slowly, indomitably.",
                    "\n",
                    "^My lips get past her knees and I shower her thighs with wet kisses. She smiles at me, her body shuddering in anticipation.",
                    "\n",
                    { "->": "ladysupersubsex2redirect" },
                    { "->": ".^.^.^.14" },
                    null
                  ]
                }
              ],
              [
                { "->": ".^.b" },
                {
                  "b": [
                    "\n",
                    "^feel obsessed about submitting to this amazing woman. I want her to see how fucking hot she is, how much she is pushing my submissive buttons. I fall to my knees and I see her raise an eyebrow in question as I take her feet into my hands.",
                    "\n",
                    "^“Oh, my wonderful, submissive boy…” she purrs as I kiss her bare feet and then take her toes in my mouth, sucking, savoring like a madman. She struggles not to rub herself off as I feast on her bare feet, licking and kissing my way up, slowly, indomitably.",
                    "\n",
                    "^My lips get past her knees and I shower her thighs with wet kisses. She smiles at me, her body shuddering in anticipation.",
                    "\n",
                    { "->": "ladyjustsubsex2" },
                    { "->": ".^.^.^.14" },
                    null
                  ]
                }
              ],
              "nop",
              "\n",
              { "#f": 5 }
            ]
          }
        ],
        { "#f": 1 }
      ],
      "ladyjustsubsex2": [
        [
          "^Fuck. As hungry as I feel, I can’t help taking a moment to take a good look at her body.",
          "\n",
          "^Her age shows at certain spots, but my god, she is a vision. Her bra is struggling to contain her ample bosom, the black material such a stark contrast against her creamy skin. I look at her, my mouth drooling as she reaches out for her panties and pulls them down, revealing a lovely trimmed pussy, overflowing with juices. I lick my lips as she finally spreads her legs invitingly.",
          "\n",
          "^“I need your tongue,” she says with urgency.",
          "\n",
          "^“Wait!” she says suddenly, and I barely manage to stop myself. “Take your boxers off… I want to look at your cock while you eat me…” she says in a voice that almost made me come on the spot.",
          "\n",
          "^I fumble with my boxers, the haste and my erection making it hard for me to get out of them quickly enough. Finally, they are off and my cock is out in all its glory.",
          "\n",
          "^“Mmm… nice,” she says and I feel sudden joy at her words. While not a monster, my cock is of good size and shape, which my former lovers never failed to emphasize.",
          "\n",
          "^“I am so hungry for you…” I blurt out, fighting the urge to plunge my cock inside that delicious pussy.",
          "\n",
          "^But no, I want to drink from her… and besides, she is the one in control.",
          "\n",
          "^No more delays. I dive between her legs, and my lips latch onto her pussy. She shudders as I start lapping away, drunk on her scent and taste. And fuck, she tastes wonderful, I kid you not. I tasted so many young pussies that didn’t come close to this mature honeypot.",
          "\n",
          "^Her moans become louder as I delve deep with my tongue, drinking her juices, swirling my tongue… I swipe left and right, up and down, mad with hunger as she arches her back and trembles with pent-up desire. As I raise my eyes towards her face, I see the surprise, the disbelief. She didn’t expect the hunger, the skill I am displaying in devouring her pussy. Well, I might be young, but this tongue has made so many girls scream my name. And I say that without boasting. I am good with my cock. But I am far better with my tongue. And right now, I am burning with desire. My cock is painfully hard, and even though it’s humping only air right now, there is no place I would rather be than here, sating my thirst on this juicy pussy.",
          "\n",
          "^“Oh my good!” Amanda screams, as I finally take her clit inside my mouth. I’ve built her up nicely and her need is too great to wait any longer. I zero in for the kill, lapping and sucking on her clit as she finally erupts on my lips.",
          "\n",
          "^“AHH! YESS!!” she screams as she convulses in orgasm, her hips grinding against my lips wildly.",
          "\n",
          "^What a feeling. My tongue gorges on her pussy, but my eyes gorge on the vision of this dark-haired, mature beauty screaming in ecstasy. There is so much joy on her pretty face.",
          "\n",
          "^I feel I might pass out as all the blood in my body has gone into my now painfully hard cock but I hold on and lick and suck until the end of her devastating orgasm. She slumps down as I keep gently nursing on her juices, avoiding the now sensitive clit.",
          "\n",
          "^“Oh, my lovely boy… I’ve never… ahh…” she speaks between breaths her face sweaty but full of joy.",
          "\n",
          "^“I can’t remember the last time I came like this… if ever,” she says laughing. I smile at her as I gently kiss and lick her labia and her inner thighs. I feel so much desire myself, but pleasing this woman is all I want to do. She glances down and smiles at the sight of my swollen cock. We stay like that for a couple of minutes, before she gets to her feet and goes into the kitchen. A moment later, she returns with a soda for each of us. Still on my knees, I take the soda and she sits in the same place as before. We both drink greedily, even if I drank so much fluid already.",
          "\n",
          "^\"You want to stick that big hard cock inside me, don't you?\"",
          "\n",
          "^\"Fuck, yes... please.\"",
          "\n",
          "^\"You were a good boy, and good boys get rewarded,\" she says with a smile, reclining on the sofa and spreading her legs.",
          "\n",
          "^Faster than a speeding bullet, I am between her legs, my hard cock aimed at her wet opening. And I pray to god that I can last long enough.",
          "\n",
          "^Oh yeah, the sweet, wet warmth of her pussy feels so good on my cock. I release a primal growl as I start fucking her, slowly.",
          "\n",
          "^“Mmm, yeah…” she moans, locking her legs around me and giving me a smoldering look. The message is clear – I ain’t going anywhere before I satisfy her. And it’s not going to be easy.",
          "\n",
          "^I quickly unclasp her bra, releasing her nicely shaped and not too large breasts. I am going to need these lovely babies. My tempo increases as I start caressing her thighs, running my hands all over her silky skin. She is so freakin’ hot, this MILF goddess.",
          "\n",
          "^I lean forward and kiss her lips and she responds eagerly. Damn, what a feeling. She moans into my lips and our tongues wrestle as I keep fucking her. I can see her climax slowly building up, but fuck me, mine is coming faster. The feel of her moist pussy on my primed cock is just too damn good… I need a distraction.",
          "\n",
          "^I move down, slipping out of her pussy and my cock screams at me in protest. But it’s all for a good cause. I start kissing and licking her breasts like a madman, my hand going to her pussy, so I get some small respite while her climax is still building. And fuck, I could gorge on her nipples forever.",
          "\n",
          "^“Agghhh… Yes, suck them… bite them…” she purrs, and I am more than happy to oblige.",
          "\n",
          "^I take her nipple between my teeth, my tongue swirling on the tip. She is leaking rivers on my hand, her breath quickening. It’s time for the finale.",
          "\n",
          "^I push inside her once again, my cock sending immediate approval. Waves of pleasure rock my body and I feel my orgasm building up quickly. Now or never.",
          "\n",
          "^I start ramming my cock with more force, the clash of our bodies resonating throughout the room. Our breath quickens, and our moans become continuous as I begin fucking her at a faster pace, using my cock as a battering ram. And she is loving every second of it. Her legs squeeze me in a tight embrace as her orgasm approaches and fuck me, I might manage to outlast her, but just barely.",
          "\n",
          "^“Ahhh! yes… faster faster!” she urges me and I get into a mad tempo, one that can’t possibly last for long. Sweat starts pouring out of me as I keep fucking her like a lunatic, my face stretched into a smile of ecstasy.",
          "\n",
          "^“Yeeess! I’m comiiiing yess!” she screams finally, and not a second too soon. Her pussy convulses all around my cock as she keeps coming in what has to be a fantastic orgasm. And I am at the very precipice myself.",
          "\n",
          "ev",
          "str",
          "^I finish on her belly",
          "/str",
          "/ev",
          { "*": ".^.c-0", "flg": 20 },
          "ev",
          "str",
          "^I finish on her tits",
          "/str",
          "/ev",
          { "*": ".^.c-1", "flg": 20 },
          {
            "c-0": [
              "\n",
              "^I laugh like a madman, finally letting go, my orgasm arriving with the power of a freight train. I slip out of her at the last second, vigorously rubbing my cock on her triangle, my cum spurting all over her crotch and her belly.",
              "\n",
              "^“Fuuuck! YEAH!” I growl as I release all my pent-up arousal, while she watches me happily with the post-orgasmic glow on her face. As my balls get emptied and my body convulses in pleasure, I search for her eyes and I feel like the king of the world. The fantastic orgasm I’ve just had and the privilege of satisfying this goddess, both at the same time. It doesn’t get better than that.",
              "\n",
              "^When my orgasm finally ends, we both start laughing.",
              "\n",
              "^“Fuck me, this was fantastic…” I say, the smile glued to my sweaty face.",
              "\n",
              "^“Fuck me, it was,” she says, imitating me, and we both burst laughing again.",
              "\n",
              "^“But, my lovely, swearing boy… there is no ‘was’ about this,” she says, pulling me in for a kiss. “This night is only beginning.”",
              "\n",
              { "->": "ladyend" },
              { "#f": 5 }
            ],
            "c-1": [
              "\n",
              "^I laugh like a madman, finally letting go, my orgasm arriving with the power of a freight train. I slip out of her at the last few seconds, putting my cock between her tits and fucking them vigorously until I finally explode.",
              "\n",
              "^“Fuuuck! YEAH!” I growl as I release all my pent-up arousal, ropes of cum spurting all over her tits and neck. As my balls get emptied and my body convulses in pleasure, I search for her eyes that glow with the post-orgasmic bliss, and I feel like the king of the world. The fantastic orgasm I’ve just had and the privilege of satisfying this goddess, both at the same time. It doesn’t get better than that.",
              "\n",
              "^When my orgasm finally ends, we both start laughing.",
              "\n",
              "^“Fuck me, this was fantastic…” I say, the smile glued to my sweaty face.",
              "\n",
              "^“Fuck me, it was,” she says, imitating me, and we both burst laughing again.",
              "\n",
              "^“But, my lovely, swearing boy… there is no ‘was’ about this,” she says, pulling me in for a kiss. “This night is only beginning.”",
              "\n",
              { "->": "ladyend" },
              { "#f": 5 }
            ]
          }
        ],
        { "#f": 1 }
      ],
      "ladyend": ["^THE END.", "\n", "done", { "#f": 1 }],
      "ladysupersubsex": [
        [
          "^I lean in and kiss her and she responds eagerly but before I can reach for her dress, she pushes me back.",
          "\n",
          "^“On your knees…” she whispers and I shudder in arousal. I go to my knees without thinking, her sexy crossed legs becoming my whole world.",
          "\n",
          "^“Take off my heels…” she says in a slightly trembling voice that betrays her own desire. She craves my submission and I am more than willing to give it to her.",
          "\n",
          "ev",
          "str",
          "^I take them off and start kissing her legs",
          "/str",
          "/ev",
          { "*": ".^.c-0", "flg": 20 },
          "ev",
          "str",
          "^I kiss and lick her high heels",
          "/str",
          "/ev",
          { "*": ".^.c-1", "flg": 20 },
          {
            "c-0": [
              "\n",
              "^I remove her high heels, taking my time to massage and caress her arches. She purrs with satisfaction as I run my fingers all over her feet, delighting in their softness. Her body seems so well cared for. Under the thin black stockings, I see the perfectly shaped blood-red toes and I groan in anticipation. The need to taste some actual flesh is overwhelming. I start kissing her feet and calves, slowly moving up.",
              "\n",
              { "->": "ladysupersubsex2" },
              { "#f": 5 }
            ],
            "c-1": [
              "\n",
              "ev",
              { "VAR?": "dom" },
              1,
              "-",
              "/ev",
              { "VAR=": "dom", "re": true },
              "^I feel completely in thrall to this mature beauty, and my submission drives me to go beyond her request. My lips find the polished leather of her elegant black high heels, and I hear her moan, as first my lips and then my tongue start laving her shoe.",
              "\n",
              "^“Oh my god…” she mouths and I raise my eyes for a moment to see her fumble around her dress, frustrated by the obstacles that bar the way to her needy pussy. She is so damn turned on by my utter submission, maybe even more than I am… maybe.",
              "\n",
              "^As the sound of our labored breathing fills the room, I feel completely lost in my desire to submit myself to this goddess. My tongue has already cleaned and shined all of her shoe… except for the soles.",
              "\n",
              "^No exceptions tonight. She looks at me, transfixed, as I swipe my tongue all over the soles of her high heels, cleaning the dirt in my mad submissive trance.",
              "\n",
              "^“This feeling of power… this is incredible…” she whispers as I finally remove her now spotless heels, and start raining kisses all over her stockinged feet and calves.",
              "\n",
              { "->": "ladysupersubsex2" },
              { "#f": 5 }
            ]
          }
        ],
        { "#f": 1 }
      ],
      "ladysupersubsex2": [
        "^She is so aroused now. I can see how much she craves to touch herself but she still keeps me away, her stockinged feet rubbing my chest and face and slowing down my ascent. But not for long. I release a small growl and she laughs when I go beyond her knees, kissing her thighs. I glimpse her black panties and fuck me, they are leaking so much.",
        "\n",
        "^“Take off my stockings…” she says, breathless, her hands fumbling at her stockings. I peel them down slowly, exposing the creamy flesh underneath. The faint scent of her perspiration and the flowery scent of her body lotion is firing up my senses. I go back down, I can’t help myself.",
        "\n",
        "^“Oh, my wonderful, submissive boy…” she purrs as I kiss her bare feet and then take her toes in my mouth, sucking, savoring like a madman. She struggles not to rub herself off as I feast on her bare feet, licking and kissing my way up, slowly, indomitably.",
        "\n",
        "^My lips get past her knees and I see desire overwhelm my mature goddess. She unzips her dress hastily and within seconds all that’s left is her sexy black underwear.",
        "\n",
        { "->": "ladysupersubsex2redirect" },
        { "#f": 1 }
      ],
      "ladysupersubsex2redirect": [
        [
          "^Fuck. As hungry as I feel, I can’t help taking a moment to take a good look at her body.",
          "\n",
          "^Her age shows at certain spots, but my god, she is a vision. Her bra is struggling to contain her ample bosom, the black material such a stark contrast against her creamy skin. I look at her, my mouth drooling as she reaches out for her panties and pulls them down, revealing a lovely trimmed pussy, overflowing with juices. I lick my lips as she finally spreads her legs invitingly.",
          "\n",
          "^“I need your tongue,” she says with urgency.",
          "\n",
          "^“Wait!” she says suddenly, and I barely manage to stop myself. “Take your boxers off… I want to look at your cock while you eat me…” she says in a voice that almost made me come on the spot.",
          "\n",
          "^I fumble with my boxers, the haste and my erection making it hard for me to get out of them quickly enough. Finally, they are off and my cock is out in all its glory.",
          "\n",
          "^“Mmm… nice,” she says and I feel sudden joy at her words. While not a monster, my cock is of good size and shape, which my former lovers never failed to emphasize.",
          "\n",
          "^“I am so hungry for you…” I blurt out, fighting the urge to plunge my cock inside that delicious pussy.",
          "\n",
          "^But no, I want to drink from her… and besides, she is the one in control.",
          "\n",
          "^No more delays. I dive between her legs, and my lips latch onto her pussy. She shudders as I start lapping away, drunk on her scent and taste. And fuck, she tastes wonderful, I kid you not. I tasted so many young pussies that didn’t come close to this mature honeypot.",
          "\n",
          "^Her moans become louder as I delve deep with my tongue, drinking her juices, swirling my tongue… I swipe left and right, up and down, mad with hunger as she arches her back and trembles with pent-up desire. As I raise my eyes towards her face, I see the surprise, the disbelief. She didn’t expect the hunger, the skill I am displaying in devouring her pussy. Well, I might be young, but this tongue has made so many girls scream my name. And I say that without boasting. I am good with my cock. But I am far better with my tongue. And right now, I am burning with desire. My cock is painfully hard, and even though it’s humping only air right now, there is no place I would rather be than here, sating my thirst on this juicy pussy.",
          "\n",
          "^“Oh my good!” Amanda screams, as I finally take her clit inside my mouth. I’ve built her up nicely and her need is too great to wait any longer. I zero in for the kill, lapping and sucking on her clit as she finally erupts on my lips.",
          "\n",
          "^“AHH! YESS!!” she screams as she convulses in orgasm, her hips grinding against my lips wildly.",
          "\n",
          "^What a feeling. My tongue gorges on her pussy, but my eyes gorge on the vision of this dark-haired, mature beauty screaming in ecstasy. There is so much joy on her pretty face.",
          "\n",
          "^I feel I might pass out as all the blood in my body has gone into my now painfully hard cock but I hold on and lick and suck until the end of her devastating orgasm. She slumps down as I keep gently nursing on her juices, avoiding the now sensitive clit.",
          "\n",
          "^“Oh, my lovely boy… I’ve never… ahh…” she speaks between breaths her face sweaty but full of joy.",
          "\n",
          "^“I can’t remember the last time I came like this… if ever,” she says laughing. I smile at her as I gently kiss and lick her labia and her inner thighs. I feel so much desire myself, but pleasing this woman is all I want to do. She glances down and smiles at the sight of my swollen cock. We stay like that for a couple of minutes, before she gets to her feet and goes into the kitchen. A moment later, she returns with a soda for each of us. Still on my knees, I take the soda and she sits in the same place as before. We both drink greedily, even if I drank so much fluid already.",
          "\n",
          "^“It’s a delight to see that cock stand so proudly… but I think I want another round of that wonderful tongue…” she says seductively. “What do you say, Paul, can you focus on me?”",
          "\n",
          "^“Whatever you want, I’ll do it,” I say sincerely, drinking in her post-orgasmic beauty.",
          "\n",
          "^“Good boy,” she purrs and then sets the soda on the table.",
          "\n",
          "^“This time we do it differently… I want to be able to tease you,” she says and turns her back on me, and then bends over on the sofa. What does she mean by that? Her ass is displayed in front of me in all its glory. I move forward and kiss the meaty globes that are still remarkably firm for her age. I then start working my tongue on her pussy once again, taking my time.",
          "\n",
          "^And then I feel her touch… Fuck. Her soft soles touch my balls first and I can’t help recoiling a little. But her touch is soft and gentle and soon I start grinding slowly into her foot, my cock now leaking precum. As I eat her pussy she runs her sole slowly all over my shaft, up and down, and I moan into her flesh. She teases me, plays with me, her sole coming and going, her touch never lasting enough to take me over the edge…",
          "\n",
          "^My tongue starts working harder, licking and sucking, and I feel her respond once again. I press harder, building her up towards another peak, as if hoping that when her release comes, mine will come too. She presses her ass into me, my tongue now twirling her clit, her foot grazing my cock lightly. I can see her orgasm build up in the movement of her hips, in the shallowness of her breath…",
          "\n",
          "^“Ahhh… your tongue… has no price… I… I want to glue your mouth to my pussy… foreveeer, AHH!!” she screams as her orgasm hits her once again.",
          "\n",
          "^Her pussy gushes in my face and I drink it all and then start humping her foot, feeling the approach of my own explosion. But before I reach my peak, she moves her foot away and I growl in frustration, sending another wave of mini-orgasms through her body.",
          "\n",
          "^“Ohhh! Fuuck!” she screams again in a rare display of profanity as she rides her climax on my face, while I try to sate my burning hunger by devouring her pussy.",
          "\n",
          "^Finally, she’s had enough and she slumps forward leaving me hanging with my hard cock. Fuck me, I believe I am becoming a medical emergency as my cock can’t seem to deflate even a little. She turns to look at me, reveling in the display of desire on my face.",
          "\n",
          "^“You were beyond amazing…” she says with joy and I can’t help smiling like a fool. That made my night, whatever happens or doesn’t happen next.",
          "\n",
          "^“Thank you… this is an amazing experience for me too… You are unlike any other woman I’ve been with,” I say honestly, my cock still obscenely pointing up.",
          "\n",
          "^“I should hope not!”",
          "\n",
          "^She chuckles and then looks at my cock again.",
          "\n",
          "^“I think we should reward this proud soldier,” she says with a smirk.",
          "\n",
          "^“Fuck yeah!” I growl and move to put it inside her honeypot.",
          "\n",
          "^“Oh, no,” she says, planting a foot on my chest and pushing me back. “No no,” she says, laughing.",
          "\n",
          "^“I am afraid this pussy can’t take any more friction for now… and besides, even though you’ve been a very good boy, you haven’t earned the privilege… yet,” she says with a smoldering look, and seeing my stricken face, she adds. “But I believe your cock loves my feet just as much.”",
          "\n",
          "^“Oh fuck…” I moan as she plants her foot on my cock. And damn, I am happy with this… I have been reveling in my submission to this mature beauty, to this goddess among women, and submitting to her desires and making her happy is all I want.",
          "\n",
          "^“Fuck yes…” I moan as she caresses my cock slowly, my precum leaking everywhere.",
          "\n",
          "^“Mmm… you swear too much, so I’ll need to shut you up somehow,” she says, pushing her other foot in my face. I suck on her tasty toes with hunger as she keeps massaging my cock expertly.",
          "\n",
          "^How can a woman be both a goddess and a demoness at the same time… She torments me by taking me to the edge of my orgasm and then moves her foot away before I can truly reach it… She reads my body language so well, and I’ve been left breathless so many times already. I am burning with the desire to come… My cum keeps building up and I swear, if it ever erupts, it will be a fucking volcano…",
          "\n",
          "^“Mmm... Mmmfmf…” I moan while sucking her toes as one more edge comes and then goes away… Will I ever get to come?",
          "\n",
          "^“I am enjoying this so much,” she says to me with sincerity. “I love your submissiveness and desire to please…” she purrs.",
          "\n",
          "^“Do you want to come?! Do you?” she says, her foot working faster now and building me up with all the pent-up need of this incredible night.",
          "\n",
          "ev",
          "str",
          "^I want to errupt all over her feet!",
          "/str",
          "/ev",
          { "*": ".^.c-0", "flg": 20 },
          "ev",
          "str",
          "^I don't deserve to come!",
          "/str",
          "/ev",
          { "*": ".^.c-1", "flg": 20 },
          {
            "c-0": [
              "\n",
              "^“FUCK YES!” I scream as the foot that was in my mouth joins the other one on my cock and she rubs my cock vigorously with her soft soles. My orgasm builds up indomitably, like an avalanche. My cock swells beyond its limits and I reach the edge…",
              "\n",
              "^“ANNGHHHH!!! YEESS!!” I roar as my cock erupts like fucking Mount Vesuvius in its prime!",
              "\n",
              "^I keep coming and coming in waves of pure ecstasy as my cum pours out of me like a river, covering Amanda’s feet and calves in pure white. Amanda laughs as she keeps milking my cock mercilessly, draining my balls dry.",
              "\n",
              "^“Fuck me…” I pant, out of breath as my orgasm starts subsiding.",
              "\n",
              "^“This was incredible…” I say, smiling like a fool, finally feeling sated after such a long buildup.",
              "\n",
              "^“And it looked incredible too,” Amanda says, smiling.",
              "\n",
              "^“Paul...” she says after a moment. “I am so glad I met you… Such wonderful submissiveness in such a lovely young body… I can’t wait to explore this further.”",
              "\n",
              "^“I feel that way too. You are incredible,” I say with honesty.",
              "\n",
              "^“The night is still young so there is plenty of time even tonight…” she says and then smirks. “but if you want us to go further, you’ll have to wash my feet first,” she says, biting her lip.",
              "\n",
              "^I look down at her feet, realizing how much mess I have made cumming.",
              "\n",
              "^“Fuck me!” I exclaim and we both burst out laughing.",
              "\n",
              "^Yeah, I have a feeling that this night will only get better…",
              "\n",
              "^THE END.",
              "\n",
              { "->": "ladysupersubsexend" },
              { "#f": 5 }
            ],
            "c-1": [
              "\n",
              "^“I… no… NO! I don’t deserve to cum!” I cry out and she looks at me in surprise and awe, taking her foot off my cock at the last moment.",
              "\n",
              "^Oh, the sweet, insane anguish… My cock twitches helplessly, one rub away from orgasming… one rub that will never come. Some beads of precum leak but nothing else. My cock is all swollen and needy and I’m afraid of touching it lest I trigger a less-than-satisfying orgasm.",
              "\n",
              "^Fuck me, why did I do this? What mad, submissive insanity has led me to withhold my own orgasm after such a long, wonderful buildup? I wish I knew… yet even if I have no answer, the expression on Amanda’s face makes it so much better. She looks at me with such joy and affection, and I feel my anguish melt before her happiness.",
              "\n",
              "^“Oh Paul, my wonderful boy… I am in awe of your delightful character and submissiveness. We are going to have so much fun,” she whispers as she kneels next to me, kissing my lips sensually. I kiss her back with passion and joy, my orgasm almost forgotten. Almost.",
              "\n",
              "^“I feel that way too,” I say with a smile as she holds my face in her hands.",
              "\n",
              "^“Good… because the night is still young,” she whispers, her hand straying down to touch my full, swollen balls.",
              "\n",
              "^“Yes… we are going to have so much fun together.”",
              "\n",
              "^THE END.",
              "\n",
              { "->": "ladysupersubsexend" },
              { "#f": 5 }
            ]
          }
        ],
        { "#f": 1 }
      ],
      "ladysupersubsexend": ["done", { "#f": 1 }],
      "ladydomsex": [
        "^The door closes behind us and I pull her in for a kiss. We both struggle to take a breath as I push my tongue inside her mouth, asserting my presence. As we kiss, our hands roam all over each other’s bodies. I feel consumed by the need to touch her bare flesh but I want more than that. I move away from her and I take a seat on the sofa.",
        "\n",
        "^She looks at me with a question but then I tap on my phone to play some pop-rock music and she immediately understands. She starts dancing, clearly eager to give me a good strip-show.",
        "\n",
        "^Holy shit. Her body sways so gracefully. The way her hips, her legs move… there is no way she hasn’t done this before. I am beginning to wonder exactly what kind of exotic life this remarkable woman led in her youth. She dances around me, playing with her dress, taking it off oh so slowly…",
        "\n",
        "^Damn, she hasn’t even fully unzipped yet but my cock is already trying to rip my pants. The show goes on, and her dress comes off. She reaches for her stocking but I stop her.",
        "\n",
        "^“Keep them on… there is nothing sexier than a woman in heels and stockings,” I say reveling in her mature beauty. “Lose the bra though. I want to see those babies.”",
        "\n",
        "^She comes closer and slowly unclasps her bra, swaying her body to the rhythm of the music, and then she flicks it away, revealing her tits. And fuck they look great for someone of her age. Not large or small and perfectly shaped, if somewhat loose.  I lick my lips in anticipation. It’s time for the next move.",
        "\n",
        "ev",
        { "VAR?": "dom" },
        3,
        ">",
        "/ev",
        [
          { "->": ".^.b", "c": true },
          {
            "b": [
              "\n",
              { "->": "ladysuperdomsex" },
              { "->": ".^.^.^.19" },
              null
            ]
          }
        ],
        [
          { "->": ".^.b" },
          {
            "b": ["\n", { "->": "ladyjustdomsex" }, { "->": ".^.^.^.19" }, null]
          }
        ],
        "nop",
        "\n",
        { "#f": 1 }
      ],
      "ladysuperdomsex": [
        [
          "ev",
          "str",
          "^I want her on her knees sucking my cock",
          "/str",
          "/ev",
          { "*": ".^.c-0", "flg": 20 },
          "ev",
          "str",
          "^I want to play with her tits",
          "/str",
          "/ev",
          { "*": ".^.c-1", "flg": 20 },
          {
            "c-0": [
              "\n",
              "ev",
              { "VAR?": "dom" },
              1,
              "+",
              "/ev",
              { "VAR=": "dom", "re": true },
              "^“Come here… and kneel,” I say, piercing her with a look.",
              "\n",
              "^“Mmm…” she says, clearly excited by my game. She walks to me and then kneels, putting her hands on my knees.",
              "\n",
              "^“You’ve been a good girl, Amanda, and good girls get rewarded,” I say playfully, as ridiculous as it is for a 23-year-old guy to call a forty-something woman ‘girl’. But I can see she is loving it.",
              "\n",
              "^“Take off my pants and my shoes… and my boxers,” I say and then lean in to whisper. “And claim your reward.”",
              "\n",
              "^She smiles and blushes slightly which looks incredibly hot on a woman of her age. She takes off all of it, while I get busy with my shirt.",
              "\n",
              "^“So, are you ready to take your reward?” I say, stroking my already hard cock. I see her lick her lips in anticipation.",
              "\n",
              "^“Yes…”",
              "\n",
              "^“Yes, what?”",
              "\n",
              "^“Yes, please…”",
              "\n",
              "^“Good girl,” I say, giving approval with my eyes. She shuffles forward and I wonder if she is going to suck on it right away. But, no… This woman knows her seduction. She extends her tongue and starts swiping it all over my balls, keeping eye contact all the time. Fuck me, it feels so good…",
              "\n",
              "^Her warm tongue bathes my balls and then switches to my shaft, going up and down but staying away from the cockhead. I feel the blood rushing to my cock, making it as hard as possible, while her tongue caresses my shaft, up and down. Then she moves up and gives me just a tiny lick on the glans.",
              "\n",
              "^“Fuck…” I moan as she revels in my reaction. Then, after a moment of hesitation, she engulfs my cockhead.",
              "\n",
              "^“Oh yeah…” I hiss as she starts swirling her tongue, licking, teasing, and then sucking my cock like a lollipop. I grab her head and push her down. She chokes but I don’t relent until the tip of my cock hits her throat.",
              "\n",
              "^Damn, I love this part so much… Breaking in a throat always feels so fucking good. But I am going to give her some time to worship my cock properly first. I let go of her head and she takes a few breaths before going in again, trying to engulf more of my cock, with limited success. I can feel her trying to swallow but my cock is probably thicker than anything she has sucked so far.",
              "\n",
              "^“That’s a good girl…” I say with a smile, relishing the feeling of power as she chokes on my cock voluntarily.",
              "\n",
              "^After another semi-successful attempt, she goes back to licking my balls and shaft, giving some rest to her throat. I recline and let her lick and suck my cock for a while. No need to rush things.",
              "\n",
              "^Although, maybe it’s time for a change of pace.",
              "\n",
              { "->": "ladysuperdomsex2" },
              { "#f": 5 }
            ],
            "c-1": [
              "\n",
              "^“Amanda, come here…” I say, taking off my shirt. “Now take off my pants and my boxers,” I say getting out of my shoes.",
              "\n",
              "^“Now we are talking…” she purrs as she crouches and pulls down my pants and my boxers, my hard cock pointing into her face.  I can see she wants it in her mouth… but no, not yet.",
              "\n",
              "^“Lie down on the sofa…” I say, and as she obliges, I sit next to her.",
              "\n",
              "^“Now, let’s give some love to these babies…” I say, leaning down and flicking my tongue over the nipple. She sighs in approval but then I suck the nipple into my mouth, relishing the taste. I play with the sensitive nub with my tongue and then I bite down on it and she gasps, pain and pleasure warring on her beautiful face.",
              "\n",
              "^“You like the pain, don’t you.”",
              "\n",
              "^“I… yeah…” she moans and I bite down again, slapping her tit with my hand. I start raining slaps all over her tits as she grunts in pain. Fuck, this is turning me on so much. I start sucking her nipples once again, savoring the taste of her arousal and pain. My cock is throbbing so much… It’s time to get it into action. I rise over her, pushing my hard cock between her lips.",
              "\n",
              "^“Ahh… yeah,” I moan as she starts sucking my cock vigorously. She moans as she licks my cockhead and my shaft, slobbering all over them. I turn around to see a huge wet patch on her panties. She is loving every second of all this.",
              "\n",
              "^“Yeah, suck it… suck it good…”",
              "\n",
              "^“Mmm…” she purrs redoubling her efforts. I push my cock inside her mouth with more force and she chokes, her saliva going everywhere. Yeah, we will get there sooner or later, but now, I want to fuck her tits. I move back and then place my cock between her tits, pushing it back and forth. She squeezes her tits around my cock, creating a soft tunnel for me to drill inside.",
              "\n",
              "^Fuck, this feels so good… I start humping her tits with more force, my cock swelling and my arousal building up. But as good as this feels, I still have places to explore.",
              "\n",
              { "->": "ladysuperdomsex2" },
              { "#f": 5 }
            ]
          }
        ],
        { "#f": 1 }
      ],
      "ladysuperdomsex2": [
        [
          "ev",
          "str",
          "^I want to fuck her throat",
          "/str",
          "/ev",
          { "*": ".^.c-0", "flg": 20 },
          "ev",
          "str",
          "^I want to fuck her pussy",
          "/str",
          "/ev",
          { "*": ".^.c-1", "flg": 20 },
          "ev",
          "str",
          "^I want to taste her pussy before fucking her",
          "/str",
          "/ev",
          { "*": ".^.c-2", "flg": 20 },
          {
            "c-0": [
              "\n",
              "^Yeah... I want to fuck her face, I want to feel her throat around my cock.",
              "\n",
              "^“Move,” I say, positioning her so that she is lying on the sofa with her head hanging… a perfect position for a facefuck.",
              "\n",
              { "->": "ladythroatfuck" },
              { "#f": 5 }
            ],
            "c-1": [
              "\n",
              "^I take off her soaked panties, taking a moment to smell her scent. And it's fantastic.",
              "\n",
              { "->": "ladypussyfuck" },
              { "#f": 5 }
            ],
            "c-2": [
              "\n",
              "^I take off her soaked panties, taking a moment to smell her scent. And it's fantastic.",
              "\n",
              { "->": "ladypussyeat" },
              { "#f": 5 }
            ]
          }
        ],
        { "#f": 1 }
      ],
      "ladythroatfuck": [
        "^\"Open your mouth,\" I say, placing my cock between her lips. I push it inside and yeah, the tip instantly hits the entrance to her throat. I intend to sheathe myself fully inside of it and this position makes it far easier. She gurgles around my cock, saliva running out of her mouth corners. I push my cock in and out of her mouth, slowly, letting her adjust to the feeling.",
        "\n",
        "^“Yeah, that’s it… just suck on it,” I say, reaching down to caress her throat. I smile at her, but the upside-down view of each other that we have makes facial communication awkward. Still, as I gently squeeze her throat, my message is clear – my cock is going to assert its dominance there.",
        "\n",
        "^And I go for it. I push my cock at the opening of her throat, increasing pressure and guiding her.",
        "\n",
        "^“Swallow… just keep swallowing. It’s gonna make things easier.”",
        "\n",
        "^She chokes and coughs as I back off and then go for it again. I push once again and I feel the struggle inside her throat. She is fighting her gag reflex, her eyes watering… I back away again but then plunge my cock harder… and her throat finally gives.",
        "\n",
        "^“Oh, fuck me, yeah!” I moan, the incredible feeling of a tight throat around my cock sending shivers throughout my body. Seeing Amanda’s distress I back away again, letting her cough and spit and breathe… but then I go back in again.",
        "\n",
        "^“You are incredible…” I moan in encouragement as I plunge down her throat. I push harder and finally, my balls touch her nose and her lips kiss the base of my cock.",
        "\n",
        "^“Damn it, this is so fucking good,” I whisper, the obscene look of her throat only firing up my arousal. I back away and then plunge again, then pull back and push inside again. I want her to find her rhythm of breathing and get used to the feeling because, once my climax mounts, I am not stopping till I spurt my cum down that lovely throat.",
        "\n",
        "^I pull out of her throat, letting her suck on my cockhead only.",
        "\n",
        "^“Take some deep breaths my lovely slut, because this is gonna get really intense soon,” I croak, and I see understanding in her eyes. She takes several big breaths as I slowly push my cock in and out, and then finally I go for it.",
        "\n",
        "^I push my hard cock inside, barreling through her throat and I start throat-fucking her with urgency. My orgasm is building up fast – her throat just feels insanely good- and my hips keep working faster and faster, my cock dominating the tight throat. I pull out for a few moments only to let her get some breaths and then go back in right away, starting the final push.",
        "\n",
        "^Gluck! Gluck! Gluck! Gluck!",
        "\n",
        "^My cock keeps ramming her throat with increasing urgency and speed, my climax coming like an avalanche.",
        "\n",
        "^“yes yes yes… YEAAAH!!” I roar as my orgasm hits me in all its intensity. Ropes of my cum go down her throat and I see her choke and spit, I see the cum and saliva coming out of her nose but I can’t make myself stop just yet. I pump several times more, riding out my orgasm, until I finally pull out of her, painting her lips with the last spurt of my cock.",
        "\n",
        "^“Fucking hell… that was awesome!” I roar as she swallows, spurts, and coughs, trying to expel everything that went down the wrong pipe. It takes half a minute before she can breathe normally but her face and throat are red as a beet.",
        "\n",
        "^“Huh… ohh… I don’t know if I can do that again…” she croaks in a raw voice.",
        "\n",
        "^“Well, maybe not tonight…” I say with a smile, pushing some of my cum from her face into her mouth. She swallows absentmindedly, clearly still in shock from the whole ordeal.  Then she takes a few wipes and cleans her face.",
        "\n",
        "^\"How do you feel?\"",
        "\n",
        "^\"I feel strange, to be honest. This was both scary and insanely hot...\" she says, shaking her head and chuckling. \"I also believe my throat will feel raw for a week.\"",
        "\n",
        "ev",
        { "VAR?": "n" },
        3,
        "==",
        "/ev",
        [
          { "->": ".^.b", "c": true },
          {
            "b": [
              "\n",
              { "->": "ladysuperdomsexend" },
              { "->": ".^.^.^.45" },
              null
            ]
          }
        ],
        [
          { "->": ".^.b" },
          {
            "b": [
              "\n",
              "ev",
              1,
              "/ev",
              { "VAR=": "n", "re": true },
              { "->": "ladychoice2" },
              { "->": ".^.^.^.45" },
              null
            ]
          }
        ],
        "nop",
        "\n",
        { "#f": 1 }
      ],
      "ladypussyfuck": [
        [
          "^I plunge my cock inside of her and she gasps, her hips arching in response. Oh yeah, the sweet, wet warmth of her pussy feels so good on my cock. I release a primal growl as I start fucking her, slowly.",
          "\n",
          "^“Mmm, yeah…” she moans, locking her legs around me and giving me a smoldering look. My tempo increases as I start caressing her thighs, running my hands all over her silky skin. She is so freakin’ hot.",
          "\n",
          "^I lean forward and kiss her lips and she responds eagerly. Damn, what a feeling. She moans into my lips and our tongues wrestle as I keep fucking her. But I want more.",
          "\n",
          "^I start ramming my cock with more force, the clash of our bodies resonating throughout the room. Our breath quickens, and our moans become continuous as I begin fucking her at a faster pace, using my cock as a battering ram. And she is loving every second of it. Her legs squeeze me in a tight embrace as her orgasm approaches and fuck me, I might manage to outlast her, but just barely.",
          "\n",
          "^“Ahhh! yes… faster faster!” she urges me and I get into a mad tempo, one that can’t possibly last for long. Sweat starts pouring out of me as I keep fucking her like a lunatic, my face stretched into a smile of ecstasy.",
          "\n",
          "^“Yeeess! I’m comiiiing yess!” she screams finally, and not a second too soon. Her pussy convulses all around my cock as she keeps coming in what has to be a fantastic orgasm. And I am at the very precipice myself.",
          "\n",
          "ev",
          "str",
          "^I want to breed her",
          "/str",
          "/ev",
          { "*": ".^.c-0", "flg": 20 },
          "ev",
          "str",
          "^I come on her face",
          "/str",
          "/ev",
          { "*": ".^.c-1", "flg": 20 },
          "ev",
          "str",
          "^I come inside her mouth",
          "/str",
          "/ev",
          { "*": ".^.c-2", "flg": 20 },
          {
            "c-0": [
              "\n",
              "^Fuck it, I ain't going anywhere. I want to breed this slut and make her mine. I slam my cock deep inside her and then it hits me…",
              "\n",
              "^“Fuuuuuck!” I scream as my body convulses in orgasmic bliss, rope after rope of my hot cum spurting deep inside Amanda’s womb. Her warm pussy clenches on my cock as my balls keep emptying.",
              "\n",
              "^I have marked her now… as my own slut. As my orgasm subsides, I look at her and I see no anger or fear on her face as a result of my actions. I smile at her and she smiles back. She wanted to be bred.",
              "\n",
              "ev",
              { "VAR?": "n" },
              1,
              "==",
              "/ev",
              [
                { "->": ".^.b", "c": true },
                {
                  "b": [
                    "\n",
                    { "->": "ladysuperdomsexend" },
                    { "->": ".^.^.^.14" },
                    null
                  ]
                }
              ],
              [
                { "->": ".^.b" },
                {
                  "b": [
                    "\n",
                    "ev",
                    3,
                    "/ev",
                    { "VAR=": "n", "re": true },
                    { "->": "ladychoice" },
                    { "->": ".^.^.^.14" },
                    null
                  ]
                }
              ],
              "nop",
              "\n",
              { "#f": 5 }
            ],
            "c-1": [
              "\n",
              "^I pull my cock out and move to her head. I keep jerking myself off as my cockhead rubs against her lips. Then it hits me.",
              "\n",
              "^“Fuuuuuck!” I scream as my body convulses in orgasmic bliss, rope after rope of my hot cum painting Amanda’s face, going into her hair, her eyes, her nose, her lips…",
              "\n",
              "^I am in ecstasy, my orgasm raging on as I see Amanda lick her lips and savor my cum. Fuck, I wish I had much more to give, but at some point, my balls had to run out of cum. I step away, breathing hard, as she chuckles, and then reaches for a tissue to wipe her face.",
              "\n",
              "ev",
              { "VAR?": "n" },
              1,
              "==",
              "/ev",
              [
                { "->": ".^.b", "c": true },
                {
                  "b": [
                    "\n",
                    { "->": "ladysuperdomsexend" },
                    { "->": ".^.^.^.14" },
                    null
                  ]
                }
              ],
              [
                { "->": ".^.b" },
                {
                  "b": [
                    "\n",
                    "ev",
                    3,
                    "/ev",
                    { "VAR=": "n", "re": true },
                    { "->": "ladychoice" },
                    { "->": ".^.^.^.14" },
                    null
                  ]
                }
              ],
              "nop",
              "\n",
              { "#f": 5 }
            ],
            "c-2": [
              "\n",
              "^I pull my cock out and move to her head.",
              "\n",
              "^\"Open!\" I order and she complies eagerly, sucking on my cockhead and milking my shaft with both hands. Then it hits me.",
              "\n",
              "^“Fuuuuuck!” I scream as my body convulses in orgasmic bliss, rope after rope of my hot cum disappearing inside Amanda's mouth. She keeps swallowing and milking my cock with her lips and her hands, and my body is shaking in pleasure as my balls get drained inside Amanda’s belly. I finally step away, my cock popping out of her mouth loudly. I take a few quick breaths, looking at her smiling face.",
              "\n",
              "ev",
              { "VAR?": "n" },
              1,
              "==",
              "/ev",
              [
                { "->": ".^.b", "c": true },
                {
                  "b": [
                    "\n",
                    { "->": "ladysuperdomsexend" },
                    { "->": ".^.^.^.14" },
                    null
                  ]
                }
              ],
              [
                { "->": ".^.b" },
                {
                  "b": [
                    "\n",
                    "ev",
                    3,
                    "/ev",
                    { "VAR=": "n", "re": true },
                    { "->": "ladychoice" },
                    { "->": ".^.^.^.14" },
                    null
                  ]
                }
              ],
              "nop",
              "\n",
              { "#f": 5 }
            ]
          }
        ],
        { "#f": 1 }
      ],
      "ladypussyeat": [
        "^I dive between her legs, and my lips latch onto her pussy. She shudders as I start lapping away, drunk on her scent and taste. And fuck, she tastes wonderful, I kid you not. I tasted so many young pussies that didn’t come close to this mature honeypot.",
        "\n",
        "^Her moans become louder as I delve deep with my tongue, drinking her juices, swirling my tongue… I swipe left and right, up and down, mad with hunger as she arches her back and trembles with pent-up desire. As I raise my eyes towards her face, I see the surprise, the disbelief. She didn’t expect the hunger, the skill I am displaying in devouring her pussy. Well, I might be young, but this tongue has made so many girls scream my name. And I say that without boasting. I am good with my cock. But I am far better with my tongue.",
        "\n",
        "^I keep licking her delicious pussy, savoring the juices and playing with her clit. I see her breathing quicken as she approaches her orgasm... But no, this beautiful mature slut will get her orgasm from my cock instead. She sighs in frustration as I stop eating her.",
        "\n",
        { "->": "ladypussyfuck" },
        { "#f": 1 }
      ],
      "ladysuperdomsexend": [
        "^\"Fuck, this was fantastic...\"",
        "\n",
        "^\"Yes, it was incredible...\" she says, smiling.",
        "\n",
        "^\"And I feel so drained and exausted,\" I say with a sigh.",
        "\n",
        "^\"So... we can go for another round in several minutes?\" she asks with a smirk.",
        "\n",
        "^I look at her, suprised, but then we both burst laughing... and fuck me, she is right!",
        "\n",
        "^THE END.",
        "\n",
        "done",
        { "#f": 1 }
      ],
      "ladychoice": [
        [
          "ev",
          "str",
          "^I am done",
          "/str",
          "/ev",
          { "*": ".^.c-0", "flg": 20 },
          "ev",
          "str",
          "^I want to fuck her throat now",
          "/str",
          "/ev",
          { "*": ".^.c-1", "flg": 20 },
          {
            "c-0": ["\n", { "->": "ladysuperdomsexend" }, { "#f": 5 }],
            "c-1": [
              "\n",
              "^“Did you enjoy it?” I ask after a moment.",
              "\n",
              "^“Oh yes…” she purrs. “I never expected I would get so turned on by your treatment…”",
              "\n",
              "^“I enjoyed your subservience immensely… so much so that my cock wants more of you,” I say, moving to her face. I place my soiled cock in front of her lips and she cleans it with her tongue, slowly at first, but then soon becomes lost in the task. She keeps nursing on my cock for a few minutes and I feel it harden inside her mouth.",
              "\n",
              "^Fuck, I want to do this differently… I want to feel her throat around my cock.",
              "\n",
              "^“Move,” I say, positioning her so that her head hangs from the sofa… a perfect position for a facefuck.",
              "\n",
              { "->": "ladythroatfuck" },
              { "#f": 5 }
            ]
          }
        ],
        { "#f": 1 }
      ],
      "ladychoice2": [
        [
          "ev",
          "str",
          "^I am done",
          "/str",
          "/ev",
          { "*": ".^.c-0", "flg": 20 },
          "ev",
          "str",
          "^I want to fuck her also",
          "/str",
          "/ev",
          { "*": ".^.c-1", "flg": 20 },
          {
            "c-0": ["\n", { "->": "ladysuperdomsexend" }, { "#f": 5 }],
            "c-1": [
              "\n",
              "^I smile at her, feeling gratitude for taking all this for my pleasure. She deserves some attention from me.",
              "\n",
              "^\"Take your panties off and lie down,\" I say and she obeys. I spread her legs, taking a moment to feast my eyes on her trimmed pussy, bathed in juices. I definitely feel hungry now... and I also need some time for my cock to recover.",
              "\n",
              { "->": "ladypussyeat" },
              { "#f": 5 }
            ]
          }
        ],
        { "#f": 1 }
      ],
      "ladyjustdomsex": [
        [
          "ev",
          "str",
          "^I want her to blow me first",
          "/str",
          "/ev",
          { "*": ".^.c-0", "flg": 20 },
          "ev",
          "str",
          "^I want to taste her first",
          "/str",
          "/ev",
          { "*": ".^.c-1", "flg": 20 },
          {
            "c-0": [
              "\n",
              "^“Come to the sofa,” I say as I start taking off my clothes. “Lose the panties and get on all fours…”",
              "\n",
              "^“Oh… I’ve always loved that position,” she says, giving me a smoldering look. She gets on the sofa on all fours and wiggles her ass towards me. Holy fuck, what an incredible sight… But that’s not the side of her I want to play with first.",
              "\n",
              "^Now fully naked, I move to her face and I offer her my semi-hard cock. She starts moving into a sitting position so her hands can be free but I stop her.",
              "\n",
              "^“No hands… This is how I want you,” I say, pushing my cock past her lips. I want her mouth only. And fuck, she can blow a cock. Everyone knows hands can provide extra stimulation during a blowjob but I am willing to sacrifice the physical for the sake of mental stimulation.",
              "\n",
              "^“Oh, yeah…” I whisper as I run my hands through her dark hair while her tongue licks my shaft and my balls. Holding on to her hair, I push my cock inside her mouth and start slowly fucking her lips. There isn’t that much physical stimulation but the warm and wet feel of her mouth combined with the intoxicating feeling of power more than makes up for it. Her hands are tied down to support her weight and I have all of the control.",
              "\n",
              "^“Mmhmm…” The sound of her slobbering is turning me on and I start increasing the rhythm.",
              "\n",
              "^“I am going to imagine that I am inside your pussy now…” I say and start pumping my cock, the tip hitting the entrance to her throat. She gags and sputters and wants to push me back.",
              "\n",
              "^“No no…” I say pulling her hands down. “I am in control here.”",
              "\n",
              "^She complies but I see the anxiety in her eyes. Good. I keep fucking her mouth in a steady rhythm, my cock still pushing against her tight throat. I know I can’t really get inside in this position, but that’s not my intention anyway. I just want her to think that. I want her to feel on edge.",
              "\n",
              "^“Yeah, that’s it… that’s it!” I moan as I keep pumping hard, my cock working like a battering ram against her throat. This feels so fucking good. Jolts of pleasure rack my body as I keep fucking her face. I look down and I see her eyes watering, I see the struggle on her face, I see her hands twitching, but she endures… And fuck I can’t not appreciate that.",
              "\n",
              "^“You are so fucking great,” I say as I pull out of her mouth and she coughs and sputters, taking some quick breaths. I lean down and I kiss her teary eyes gently.",
              "\n",
              "^“I know,” she says in a raspy voice, wiping her eyes and managing a smile.",
              "\n",
              "^“Stay on all fours. It’s time for me to give back some of the love,” I say as I move to her curvy ass and take a moment to marvel at its shape and volume. Damn, this is one sexy lady.",
              "\n",
              "^I get to my knees and swipe my tongue all over her leaking pussy, savoring the exquisite taste. It seems that my rough treatment was turning her on.",
              "\n",
              "^“Ahhh, yes…” she purrs, her body shuddering in anticipation. I smile and dive in, licking her tasty folds with feral hunger. My hands caress her stockinged thighs as my tongue penetrates deep inside her pussy. Fuck, a person could get addicted to this.",
              "\n",
              "^I chuckle at the thought and start sucking her pussy, determined to drink all of her fluids. She purrs and moans, pushing her pussy into my face.",
              "\n",
              "^“Mmm… you love this,” I say between licks.",
              "\n",
              "^“Yes… Please, continue…” she says, sticking her ass even more. Fuck, what a view. I slap her buttocks and then squeeze them, relishing the feeling of those meaty globes beneath my palms.",
              "\n",
              "^“You are so fucking sexy…” I growl and dive back in, slurping and licking furiously. She starts sighing and moaning as I drink from her, my tongue finding her swollen clit.",
              "\n",
              "^“Ahhhh! Fuck!” she cries out and I chuckle. She isn’t the type to use profanities. But everyone has their limit it seems. I suck on her clit her cries of pleasure becoming more urgent. I can feel her orgasm approaching.",
              "\n",
              "^But no, I want her to come with my cock inside her pussy. I stand up, licking my lips and watching her twitch with need.",
              "\n",
              { "->": "ladyjustdomsex2" },
              { "#f": 5 }
            ],
            "c-1": [
              "\n",
              "^\"Sit on the sofa... and lose your panties,\" I say as I start getting naked myself. She smiles and walks to the sofa, swaying her hips exaggeratedly. Fuck I am so hungry for this sexy mature body… I want to taste her so bad. I quickly kneel before her and she opens her legs invitingly, her face tense in anticipation.",
              "\n",
              "^I dive between her legs, and my lips latch onto her pussy. She shudders as I start lapping away, drunk on her scent and taste. And fuck, she tastes wonderful, I kid you not. I tasted so many young pussies that didn’t come close to this mature honeypot.",
              "\n",
              "^Her moans become louder as I delve deep with my tongue, drinking her juices, swirling my tongue… I swipe left and right, up and down, mad with hunger as she arches her back and trembles with pent-up desire. As I raise my eyes towards her face, I see the surprise, the disbelief. She didn’t expect the hunger, the skill I am displaying in devouring her pussy. Well, I might be young, but this tongue has made so many girls scream my name. And I say that without boasting. I am good with my cock. But I am far better with my tongue.",
              "\n",
              "^I keep licking her delicious pussy, savoring the juices and playing with her clit. I see her breathing quicken as she approaches her orgasm... But no, this beautiful mature slut will get her orgasm from my cock instead. She sighs in frustration as I stop eating her.",
              "\n",
              "^\"Get on all fours,\" I say, rising to my feet.",
              "\n",
              "^“Oh… I’ve always loved that position,” she says, giving me a smoldering look. She gets on the sofa on all fours and wiggles her ass towards me. Holy fuck, what an incredible sight… but I want to feel her mouth first.",
              "\n",
              "^I move to her face and I offer her my semi-hard cock. She starts moving into a sitting position so her hands can be free but I stop her.",
              "\n",
              "^“No hands… This is how I want you,” I say, pushing my cock past her lips. I want nothing but her mouth. And fuck, she can blow a cock. Everyone knows hands can provide extra stimulation during a blowjob but I am willing to sacrifice the physical for the sake of mental stimulation.",
              "\n",
              "^“Oh, yeah…” I whisper as I run my hands through her dark hair while her tongue licks my shaft and my balls. Holding on to her hair, I push my cock inside her mouth and start slowly fucking her lips. There isn’t that much physical stimulation but the warm and wet feel of her mouth combined with the intoxicating feeling of power more than makes up for it. Her hands are tied down to support her weight and I have all of the control.",
              "\n",
              "^“Mmhmm…” The sound of her slobbering is turning me on and I start increasing the rhythm.",
              "\n",
              "^“I am going to imagine that I am inside your pussy now…” I say and start pumping my cock, the tip hitting the entrance to her throat. She gags and sputters and wants to push me back.",
              "\n",
              "^“No no…” I say pulling her hands down. “I am in control here.”",
              "\n",
              "^She complies but I see the anxiety in her eyes. Good. I keep fucking her mouth in a steady rhythm, my cock still pushing against her tight throat. I know I can’t really get inside in this position, but that’s not my intention anyway. I just want her to think that. I want her to feel on edge.",
              "\n",
              "^“Yeah, that’s it… that’s it!” I moan as I keep pumping hard, my cock working like a battering ram against her throat. This feels so fucking good. Jolts of pleasure rack my body as I keep fucking her face. I look down and I see her eyes watering, I see the struggle on her face, I see her hands twitching, but she endures… And fuck I can’t not appreciate that.",
              "\n",
              "^“You are so fucking great,” I say as I pull out of her mouth and she coughs and sputters, taking some quick breaths. I lean down and I kiss her teary eyes gently.",
              "\n",
              "^“I know,” she says in a raspy voice, wiping her eyes and managing a smile.",
              "\n",
              "^\"Its time for the main event,\" I say playfully, moving to her ass. Fuck me, what a sight. I can't help making a few swipes with my tongue, tasting her juices again and running my tongue all over her globes. This is one hot MILF.",
              "\n",
              { "->": "ladyjustdomsex2" },
              { "#f": 5 }
            ]
          }
        ],
        { "#f": 1 }
      ],
      "ladyjustdomsex2": [
        [
          "^“Ohhh… Give it to me…” she says in a frustrated voice.",
          "\n",
          "^Well, who am I to say no to that?",
          "\n",
          "^“Ohhh… fuck!” I cry out as her warm pussy engulfs my cock. I put my hands on her buttocks and I start fucking her slowly. I don’t want her to come too quickly.",
          "\n",
          "^“Mmmm… yes… fuck me,” she purrs, going down to her elbows and sticking her ass out even more.",
          "\n",
          "^Damn, there is something about fucking doggy style, something about control and the sight of a woman’s back and ass that gives extra spice to this feeling. Oh yeah… I fuck her in a steady rhythm, running my hands all over her back and occasionally slapping her buttocks. As I do it, I remember that joke about a man saying how he slaps his wife’s butt every time before going to work, only to find it vibrating still when he returns from work.",
          "\n",
          "^I laugh and slap her buttocks again, watching the flesh vibrate. What's the punchline here? Ah yes, it’s not that my wife’s butt is soft, it’s just that my working hours are so short! Amanda turns her head to watch me laugh. I wink at her and slap her butt again.",
          "\n",
          "^Yeah, time to slap these babies, but not only with my hands… It’s time they felt my crotch.",
          "\n",
          "^I start fucking her with force, ramming into her, the sound of my crotch clapping into her butt resonating among the sounds of our moans.",
          "\n",
          "^“Yess… yes… come on, faster!” she cries out, and fuck, I am ready to oblige.",
          "\n",
          "^I pick up my speed, beads of sweat forming on my forehead as I slam into her violently. There is no way we can endure this rhythm for long. Her moaning becomes continuous and I feel her hips rotate around my cock. Her orgasm is approaching.",
          "\n",
          "^“Ahh… Mmmmm… Yeeesss! Ahhh!” she cries out as she slams her ass into me, her fluids gushing into my crotch. Her back arches as I keep ramming into her throughout her orgasm. When her body settles down, I hear her release a deep sigh of satisfaction. I smile, my cock still drilling her pussy, and fuck, I am so close myself. I feel my balls churning, ready to expel the cum, forcefully.",
          "\n",
          "ev",
          "str",
          "^I cum on her ass and back",
          "/str",
          "/ev",
          { "*": ".^.c-0", "flg": 20 },
          "ev",
          "str",
          "^I paint her face",
          "/str",
          "/ev",
          { "*": ".^.c-1", "flg": 20 },
          "ev",
          "str",
          "^I cum in her mouth",
          "/str",
          "/ev",
          { "*": ".^.c-2", "flg": 20 },
          {
            "c-0": [
              "\n",
              "^I pull out of her at the last moment, ramming my cock between her buttocks, the touch of her glistening globes triggering my orgasm.",
              "\n",
              "^“Fuuuuuck!” I scream as my body convulses in orgasmic bliss, rope after rope of my hot cum painting Amanda’s ass and back. I am in ecstasy, my orgasm raging on as I see Amanda turn her head and smile at me. Fuck, I wish I had more cum to give, but at some point, my balls had to run out of it. I step away, breathing hard, watching the whiteness of her ass and back. That was a fucking big load.",
              "\n",
              { "->": "ladyjustdomsexend" },
              { "#f": 5 }
            ],
            "c-1": [
              "\n",
              "^I quickly pull my cock out and rush to her head. My need to come is fucking overwhelming. I keep jerking myself off as my cockhead rubs against her lips. Then it hits me.",
              "\n",
              "^“Fuuuuuck!” I scream as my body convulses in orgasmic bliss, rope after rope of my hot cum painting Amanda’s face, going into her hair, her eyes, her nose, her lips…",
              "\n",
              "^I am in ecstasy, my orgasm raging on as I see Amanda lick her lips and savor my cum. Fuck, I wish I had much more to give, but at some point, my balls had to run out of cum. I step away, breathing hard, as she chuckles, and then reaches for a tissue to wipe her face.",
              "\n",
              { "->": "ladyjustdomsexend" },
              { "#f": 5 }
            ],
            "c-2": [
              "\n",
              "^I quickly pull my cock out and rush to her head. My need to come is fucking overwhelming.",
              "\n",
              "^\"Open!\" I order and she complies eagerly, sucking on my cockhead and milking my shaft with both hands. Then it hits me.",
              "\n",
              "^“Fuuuuuck!” I scream as my body convulses in orgasmic bliss, rope after rope of my hot cum disappearing inside Amanda's mouth. She keeps swallowing and milking my cock with her lips and her hands, and my body is shaking in pleasure as my balls get drained inside Amanda’s belly. I finally step away, my cock popping out of her mouth loudly. I take a few quick breaths, looking at her smiling face.",
              "\n",
              { "->": "ladyjustdomsexend" },
              { "#f": 5 }
            ]
          }
        ],
        { "#f": 1 }
      ],
      "ladyjustdomsexend": [
        "^\"Fuck, this was fantastic...\"",
        "\n",
        "^\"Yes, it was incredible...\" she says, smiling.",
        "\n",
        "^\"And I feel so drained and exausted,\" I say with a sigh.",
        "\n",
        "^\"So... we can go for another round in several minutes?\" she asks with a smirk.",
        "\n",
        "^I look at her, suprised, but then we both burst laughing... and fuck me, she is right!",
        "\n",
        "^THE END.",
        "\n",
        "end",
        { "#f": 1 }
      ],
      "global decl": [
        "ev",
        0,
        { "VAR=": "dom" },
        0,
        { "VAR=": "rng" },
        0,
        { "VAR=": "n" },
        "/ev",
        "end",
        null
      ],
      "#f": 1
    }
  ],
  "listDefs": {}
}
